[
  {
    "title": "Arc vs. Edge: Should you switch from Microsoft’s web browser?",
    "description": "Arc brings a fresh approach to web-browsing. But is it good enough to leave your tried-and-tested Edge setup?",
    "content": "Key Takeaways Arc offers a fresh UI, themes, and AI features, making it a solid browser choice for Mac and Windows users. Microsoft Edge, a feature-rich Chromium browser with cross-platform availability, strong security, and privacy settings. Compare... [7284 chars]",
    "url": "https://www.xda-developers.com/arc-vs-edge-should-you-switch-from-microsofts-web-browser/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/05/arc-vs-edge-1.jpg",
    "publishedAt": "2024-05-15T22:00:15Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.8225
  },
  {
    "title": "Microsoft just patched a ton of Windows security flaws including two dangerous zero-days - update your PC right now",
    "description": "Microsoft has fixed a total of 61 new security flaws in Windows including two actively exploited zero-days as part of this month’s Patch Tuesday updates.",
    "content": "Microsoft has released its latest Patch Tuesday updates and you’re going to want to install them ASAP as they contain fixes for 61 security flaws including two zero-days hackers are exploiting in the wild. As The Hacker News , reports of these 61 sec... [4525 chars]",
    "url": "https://www.tomsguide.com/computing/online-security/microsoft-just-patched-a-ton-of-windows-security-flaws-including-two-dangerous-zero-days-update-your-pc-right-now",
    "image": "https://cdn.mos.cms.futurecdn.net/Ruv9c5478k3Qmvy84rANcU-1200-80.jpg",
    "publishedAt": "2024-05-15T18:15:49Z",
    "source": {
      "name": "Tom's Guide",
      "url": "https://www.tomsguide.com"
    },
    "sentiment_score": -0.0516
  },
  {
    "title": "Buy Microsoft Office 2019 and Windows 11 Pro for just $50 with this deal",
    "description": "This lifetime license bundle deal gives you access to the entire Microsoft Office Pro 2019 suite and Windows 11 Pro for 88% off.",
    "content": "Save on a lifetime license to Microsoft Office Pro and Windows 11 Pro via Stack Social. Sabrina Ortiz/ZDNET No matter if you're upgrading to a new laptop or setting yourself up for maximum functionality at school, work or your home office, access to ... [2606 chars]",
    "url": "https://www.zdnet.com/article/microsoft-office-2019-windows-11-pro-deal/",
    "image": "https://www.zdnet.com/a/img/resize/1b2a58f62b6fe399e5295502a4f7819fc67aafd4/2023/10/20/4773d141-fddd-441d-8ba9-c77af697d900/stack-social-microsoft.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-05-15T16:00:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.4812
  },
  {
    "title": "Microsoft finally fixed that annoying Windows VPN bug that plagued users for weeks",
    "description": "Using a VPN on Windows has been a frustrating experience in the past few weeks, but hopefully, those times are now over.",
    "content": "Key Takeaways Microsoft's latest Windows update, KB5037771, finally fixes the annoying VPN bug on Windows 10 and 11 Be aware of a new bug with profile pictures that may arise after installing the update. Microsoft is working on a fix for the error. W... [1966 chars]",
    "url": "https://www.xda-developers.com/microsoft-finally-fixed-windows-vpn-bug/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2023/11/petter-lagson-netfkkuo7vy-unsplash.jpg",
    "publishedAt": "2024-05-15T15:16:37Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": -0.6597
  },
  {
    "title": "Long Awaited Valheim Ashlands Update Is Out Now, Though Microsoft Store and Xbox Versions Are Delayed",
    "description": "Iron Gate has released the long awaited Valheim Ashlands update to live servers, but the Microsoft Store and Xbox versions have been delayed.",
    "content": "Around three weeks after the beginning of public testing, indie developer Iron Gate released the long-awaited Valheim Ashlands update on live servers. However, the Microsoft Store and Xbox versions have been delayed due to unforeseen issues: Unfortun... [1639 chars]",
    "url": "https://wccftech.com/long-awaited-valheim-ashlands-update-is-out-now-though-microsoft-store-and-xbox-versions-are-delayed/",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2024/05/valheim-ashlands-HD-scaled.jpg",
    "publishedAt": "2024-05-15T10:00:44Z",
    "source": {
      "name": "Wccftech",
      "url": "https://wccftech.com"
    },
    "sentiment_score": -0.2263
  },
  {
    "title": "Microsoft: At The Forefront Of AI Revolution (NASDAQ:MSFT)",
    "description": "Microsoft reports strong quarterly earnings driven by cloud business momentum & solid performance. $80B cash enables flexibility for large acquisitions.",
    "content": "HJBC Investment thesis My previous bullish thesis about Microsoft (NASDAQ:MSFT) aged decently as the stock gained almost 2% over the last three months. A lot of positive developments happened since my previous call, and today I want to share my opini... [8112 chars]",
    "url": "https://seekingalpha.com/article/4693134-microsoft-at-the-forefront-of-ai-revolution",
    "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1289079656/image_1289079656.jpg?io=getty-c-w1536",
    "publishedAt": "2024-05-14T17:32:21Z",
    "source": {
      "name": "Seeking Alpha",
      "url": "https://seekingalpha.com"
    },
    "sentiment_score": 0.8271
  },
  {
    "title": "Microsoft Teams becomes a whole lot better with new features, more enhancements on the horizon",
    "description": "Microsoft announces a host of new features to elevate the user experience in Teams. It has also teased what's more to come in the coming months.",
    "content": "Key Takeaways Creating and joining teams and channels is now faster and more efficient with new features like template options and a streamlined process. Enhanced collaboration in Microsoft Teams includes AI-powered Discover feed, improved content sh... [4039 chars]",
    "url": "https://www.xda-developers.com/microsoft-teams-becomes-a-whole-lot-better-with-new-features/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/03/unified-teams-app-2.jpg",
    "publishedAt": "2024-05-14T17:27:59Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.8718
  },
  {
    "title": "Windows 11's Screenshot Tool Will Let You Scan QR Codes",
    "description": "Windows 11's Snipping Tool is getting several useful features, such as the ability to scan QR codes, annotate with emoji, and show or hide the ruler. Microsoft Paint's Cocreator AI image generator is being rebranded to Image Creator.",
    "content": "Credit: Microsoft Microsoft is updating the Windows 11 Snipping Tool, which is the platform's default option for capturing and annotating screenshots. Soon, you'll be able to use the Snipping Tool to scan QR codes in screenshots, finally giving you a... [2963 chars]",
    "url": "https://lifehacker.com/tech/windows-11-screenshot-tool-scan-qr-codes-use-emoji",
    "image": "https://lifehacker.com/imagery/articles/01HXVJN9Y78GAMWTE42TNGDG67/hero-image.fill.size_1200x675.png",
    "publishedAt": "2024-05-14T14:30:00Z",
    "source": {
      "name": "Lifehacker",
      "url": "https://lifehacker.com"
    },
    "sentiment_score": 0.6124
  },
  {
    "title": "Microsoft Reveals New Xbox Game Pass Games for May and June, Including Immortals, Lords of the Fallen, More",
    "description": "Microsoft has announced the new Xbox Game Pass games coming to the service in the coming weeks, including Immortals, and Lords of the Fallen.",
    "content": "Microsoft has announced the new Xbox Game Pass games coming to the service in the coming weeks. We knew that Lords of the Fallen would be added to Microsoft's subscription service at some point, but as now confirmed, the 2023 title from Hexworks will... [1533 chars]",
    "url": "https://wccftech.com/xbox-game-pass-games-may-june/",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2024/05/xbox-game-pass-may-june-2024.png",
    "publishedAt": "2024-05-14T14:16:19Z",
    "source": {
      "name": "Wccftech",
      "url": "https://wccftech.com"
    },
    "sentiment_score": -0.1901
  },
  {
    "title": "Get Microsoft Visio Professional 2021 for Just $20 for the Next Few Days",
    "description": "Microsoft's diagramming and data management software is a snip at this price.",
    "content": "If you're in a line of work where you need to be able to wrap your head around a lot of information, getting the right software can be a big help. One of the best out there is Microsoft's Visio professional, and at the moment, you can get yourself a ... [1236 chars]",
    "url": "https://www.cnet.com/deals/get-microsoft-visio-professional-2021-for-just-20-for-the-next-few-days/",
    "image": "https://www.cnet.com/a/img/resize/9b5b3e4a7d7b3d8ac0b8b1535e4addd348bded76/hub/2024/04/19/fa277241-6c5c-4d2f-8d0d-5ac0b8b9c4fd/microsoft-visio-pro.png?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-05-14T08:03:00Z",
    "source": {
      "name": "CNET",
      "url": "https://www.cnet.com"
    },
    "sentiment_score": 0.7845
  },
  {
    "title": "Microsoft plans to make the next Call of Duty a day-one release on Xbox Game Pass",
    "description": "The enormously successful Call of Duty franchise has entertained first-person shooter fans on all platforms since 2003. The title is one of the main reasons Microsoft fought...",
    "content": "In context: Microsoft Gaming CEO Phil Spencer recently confirmed the company's ambition to bring Activision Blizzard games to the Xbox Game Pass subscription service. The Xbox division will likely formalize the plan next month as it introduces the ne... [2074 chars]",
    "url": "https://www.techspot.com/news/103053-microsoft-plans-make-next-call-duty-day-one.html",
    "image": "https://www.techspot.com/images2/news/bigimage/2024/05/2024-05-17-image-24.jpg",
    "publishedAt": "2024-05-17T21:08:00Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "PlayStation's Secret Weapon Is Lurking In A Quiet Summer Game Lineup",
    "description": "While Microsoft stopped selling the Xbox One years ago, Sony is still churning out PlayStation 4s. Now, cross-generation compatibility looks like the future of gaming.",
    "content": "Recent PlayStation headlines have been mixed, with IGN lamenting that Sony’s summer release schedule is bare even as Sony continues to stomp Microsoft in the sales department. PlayStation 5 owners have recently enjoyed Helldivers 2, Stellar Blade, an... [3554 chars]",
    "url": "https://www.inverse.com/gaming/ps5-playstation-outselling-xbox-sony-strategy",
    "image": "https://imgix.bustle.com/uploads/getty/2024/5/17/25fb7948/a-sony-playstation-5.jpg?w=1200&h=630&fit=crop&crop=focalpoint&fm=jpg&fp-x=0.6818&fp-y=0.5794",
    "publishedAt": "2024-05-17T16:40:56Z",
    "source": {
      "name": "Inverse",
      "url": "https://www.inverse.com"
    },
    "sentiment_score": 0.0772
  },
  {
    "title": "Call of Duty 2024 Coming to Game Pass is a Done Deal According to the Wall Street Journal",
    "description": "Reportedly, the call has been made to put this year's Call of Duty on Game Pass. Will the move pan out for Microsoft?",
    "content": "Is Call of Duty coming to Xbox Game Pass? When Microsoft first began pursuing it’s $69 billion acquisition of Activision Blizzard, many assumed using Call of Duty to bolster Game Pass was one of their goals, but things have changed since then. Game P... [2114 chars]",
    "url": "https://wccftech.com/call-of-duty-2024-coming-to-game-pass/",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2020/12/WCCFcallofdutyblackopscoldwar19.jpg",
    "publishedAt": "2024-05-17T15:18:53Z",
    "source": {
      "name": "Wccftech",
      "url": "https://wccftech.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Windows 10 will reach end of life next year, but what does that mean?",
    "description": "Microsoft's Windows 10 will reach its end-of-life stage next year, but the implications for your PC aren't immediately obvious.",
    "content": "Key Takeaways After October 14th, 2025, Windows 10 won't get updates. You can pay for Extended Security Updates if you want to keep using it. Consider upgrading to Windows 11 if you don't want to pay up. It's been known for a while now that Windows 1... [6644 chars]",
    "url": "https://www.xda-developers.com/windows-10-end-of-life-2025-what-does-it-mean/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/04/macbook-windows-5.jpg",
    "publishedAt": "2024-05-17T15:00:13Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.3343
  },
  {
    "title": "The next Call of Duty will reportedly hit Game Pass on its release day",
    "description": "It seems that Microsoft has decided to bring the next Call of Duty game to Game Pass on day one. Executives had reportedly been debating for some time how to handle the upcoming release.",
    "content": "Recent reports suggested that Microsoft executives had been debating for some time whether to put new Call of Duty games onto Game Pass on day one (i.e. on their release day). That seems like something it should have figured out before spending $68.7... [2612 chars]",
    "url": "https://www.engadget.com/the-next-call-of-duty-will-reportedly-hit-game-pass-on-its-release-day-142332534.html",
    "image": "https://s.yimg.com/ny/api/res/1.2/EyNGtMaJ6WMn_CGCPT.N4A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-02/8e84e730-b1f2-11ed-9aff-8be3481a7e0b",
    "publishedAt": "2024-05-17T14:23:33Z",
    "source": {
      "name": "Engadget",
      "url": "https://www.engadget.com"
    },
    "sentiment_score": 0.3612
  },
  {
    "title": "Microsoft Will Team With AMD To Provide A.I. MI300X Products On Azure",
    "description": "Tech giant Microsoft is gearing up for a major overhaul to its A.I. chip portfolio at the upcoming Build conference says VP.",
    "content": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy. After successfully maintaining and leveraging a close relationship with one of the world's leading artificial i... [3299 chars]",
    "url": "https://wccftech.com/microsoft-will-team-with-amd-to-provide-a-i-mi300x-products-on-azure/",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2023/10/WCCFmicrosoftnadellahardware-HD-scaled.jpg",
    "publishedAt": "2024-05-17T05:16:29Z",
    "source": {
      "name": "Wccftech",
      "url": "https://wccftech.com"
    },
    "sentiment_score": 0.25
  },
  {
    "title": "Why Microsoft is still ahead of Google in the war for AI developers",
    "description": "Google, despite its technical prowess, will need to double down on its efforts to simplify and streamline its AI offerings for developers if it hopes to catch up.",
    "content": "Join us in returning to NYC on June 5th to collaborate with executive leaders in exploring comprehensive methods for auditing AI models regarding bias, performance, and ethical compliance across diverse organizations. Find out how you can attend here... [9495 chars]",
    "url": "https://venturebeat.com/ai/why-microsoft-is-still-ahead-of-google-in-the-war-for-ai-developers/",
    "image": "https://venturebeat.com/wp-content/uploads/2024/05/Screenshot-2024-05-16-at-11.00.19-AM.png?w=1200&strip=all",
    "publishedAt": "2024-05-16T19:54:21Z",
    "source": {
      "name": "VentureBeat",
      "url": "https://venturebeat.com"
    },
    "sentiment_score": 0.7269
  },
  {
    "title": "What to expect from Microsoft Build 2024: The Surface event, Windows 11 and AI",
    "description": "Microsoft has a Surface showcase and its Build developer conference planned for early next week. Here's what we expect.",
    "content": "If you can't tell by now, just about every tech company is eager to pray at the altar of AI, for better or worse. Google's recent I/O developer conference was dominated by AI features, like its seemingly life-like Project Astra assistant. Just before... [7621 chars]",
    "url": "https://www.engadget.com/what-to-expect-from-microsoft-build-2024-the-surface-event-windows-11-and-ai-182010326.html",
    "image": "https://s.yimg.com/ny/api/res/1.2/bGXyrFpM47B1QeQ1q1mbmA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/dd3b7e50-13a5-11ef-b8ff-81dbcadb3c81",
    "publishedAt": "2024-05-16T18:20:10Z",
    "source": {
      "name": "Engadget",
      "url": "https://www.engadget.com"
    },
    "sentiment_score": 0.7269
  },
  {
    "title": "Microsoft asks some employees in China to move to other countries",
    "description": "Microsoft has asked at least 100 of its employees in China to consider moving to other countries, according to Chinese state media reports.",
    "content": "Editor’s Note: Sign up for CNN’s Meanwhile in China newsletter, which explores what you need to know about the country’s rise and how it impacts the world. CNN — Microsoft has asked at least 100 of its employees in China to consider moving to other c... [2278 chars]",
    "url": "https://edition.cnn.com/2024/05/16/tech/microsoft-china-employees-relocate-hnk-intl/index.html",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2152617856.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-05-16T12:55:13Z",
    "source": {
      "name": "Cable News Network",
      "url": "https://edition.cnn.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Microsoft offers relocation to hundreds of China-based AI staff",
    "description": "Microsoft has reportedly asked employees at its China-based cloud-computing and artificial-intelligence operations to consider relocation outside of China.",
    "content": "Microsoft has reportedly asked China-based cloud computing and artificial intelligence operations employees to consider relocating out of the country, as Washington cracks down on Beijing's access to the advanced technology. The Wall Street Journal b... [1378 chars]",
    "url": "https://www.cnbc.com/2024/05/16/microsoft-offers-relocation-to-hundreds-of-china-based-ai-staff-.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107415741-1715843418989-gettyimages-1234065081-AFP_9FE6YN.jpeg?v=1715843445&w=1920&h=1080",
    "publishedAt": "2024-05-16T08:32:16Z",
    "source": {
      "name": "CNBC",
      "url": "https://www.cnbc.com"
    },
    "sentiment_score": 0.6249
  },
  {
    "title": "Xbox Game Pass Tier Changes Are Inbound Due to Call of Duty, Insiders Claim",
    "description": "Changes to Xbox Game Pass tiers are inbound due to the rumored inclusion of the new Call Duty on Microsoft's subscription service.",
    "content": "Changes to Xbox Game Pass tiers are inbound due to the rumored inclusion of the new Call Duty on Microsoft's subscription service. Yesterday we covered a report from outlet WSJ that claimed that this year's Call of Duty entry would be coming to Game ... [1621 chars]",
    "url": "https://wccftech.com/xbox-game-pass-tier-changes-cod/",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2024/05/Xbox-Game-Pass-Tier-Changes-Call-of-Duty-Prices.jpg",
    "publishedAt": "2024-05-18T05:56:24Z",
    "source": {
      "name": "Wccftech",
      "url": "https://wccftech.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "How to watch the Microsoft Build 2024 keynote live on May 21",
    "description": "Microsoft is streaming its Build 2024 keynote on Tuesday. Here's how to watch -- and what to know about the lower-profile event the day before.",
    "content": "Springtime means it’s keynote season in the tech world, and in 2024, that means “time to show off your AI bona fides.” Google and OpenAI have already revealed big new upgrades to Gemini and ChatGPT this month, and now it’s time for Microsoft Build. T... [2523 chars]",
    "url": "https://www.engadget.com/how-to-watch-the-microsoft-build-2024-keynote-live-on-may-21-003204596.html",
    "image": "https://s.yimg.com/ny/api/res/1.2/pz8afy8PRMVhmHAtZS03jw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/c1f32200-16d0-11ef-bff7-037a785b4e97",
    "publishedAt": "2024-05-18T00:32:04Z",
    "source": {
      "name": "Engadget",
      "url": "https://www.engadget.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Microsoft wants to make Windows an AI operating system, launches Copilot+ PCs",
    "description": "Microsoft unveiled a new lineup of Windows machines it's calling Copilot+ PCs, plus generative AI-powered features. And new Microsoft Surface devices are on the way.",
    "content": "Microsoft wants to bring generative AI to the forefront of Windows — and the PCs running it. At a pair of keynotes during its annual Build developer conference this week, the company unveiled a new lineup of Windows machines it’s calling Copilot+ PCs... [9619 chars]",
    "url": "https://techcrunch.com/2024/05/21/microsoft-build-2024-windows-ai-operating-system-copilot-plus-pcs/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/03/GettyImages-1238869000.jpg?w=1024",
    "publishedAt": "2024-05-21T21:29:00Z",
    "source": {
      "name": "TechCrunch",
      "url": "https://techcrunch.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Microsoft and Khan Academy partner to show how AI can transform education",
    "description": "Microsoft partners with Khan Academy to show AI's impact on education, using Azure OpenAI for Khanmigo, building Phi-3 math models, and more.",
    "content": "Join us in returning to NYC on June 5th to collaborate with executive leaders in exploring comprehensive methods for auditing AI models regarding bias, performance, and ethical compliance across diverse organizations. Find out how you can attend here... [5225 chars]",
    "url": "https://venturebeat.com/ai/microsoft-to-enhance-khan-academys-ai-bot-with-azure-openai-service-develop-phi-3-math-model/",
    "image": "https://venturebeat.com/wp-content/uploads/2024/05/adobe-firefly-college-morter-board.jpg?w=1024?w=1200&strip=all",
    "publishedAt": "2024-05-21T15:30:00Z",
    "source": {
      "name": "VentureBeat",
      "url": "https://venturebeat.com"
    },
    "sentiment_score": 0.7269
  },
  {
    "title": "Microsoft Copilot Studio to let developers build bots that act like agents",
    "description": "Microsoft is enhancing its Copilot Studio, helping businesses turn bots into smart autonomous AI agents, making Copilot extensions and more.",
    "content": "Join us in returning to NYC on June 5th to collaborate with executive leaders in exploring comprehensive methods for auditing AI models regarding bias, performance, and ethical compliance across diverse organizations. Find out how you can attend here... [3719 chars]",
    "url": "https://venturebeat.com/ai/microsoft-copilot-studio-will-let-developers-build-ai-bots-that-act-like-agents/",
    "image": "https://venturebeat.com/wp-content/uploads/2024/05/Copilot-Studio-homepage.jpg?w=1200&strip=all",
    "publishedAt": "2024-05-21T15:30:00Z",
    "source": {
      "name": "VentureBeat",
      "url": "https://venturebeat.com"
    },
    "sentiment_score": 0.7269
  },
  {
    "title": "Microsoft Azure gets 'Models as a Service,' enhanced RAG offerings for enterprise generative AI",
    "description": "The annual developer conference, Microsoft Build, saw a slew of upgrades to Azure AI Services - with many in preview already.",
    "content": "Sabrina Ortiz/ZDNET At its annual Build developer conference on Tuesday, Microsoft unveiled several new capabilities of its Azure AI Services within its Azure cloud computing business, with a focus on generative artificial intelligence. The new capab... [6970 chars]",
    "url": "https://www.zdnet.com/article/microsoft-azure-gets-models-as-a-service-enhanced-rag-offerings-for-enterprise-generative-ai/",
    "image": "https://www.zdnet.com/a/img/resize/7a48e9719efca5503df95662f93bf267388f2d1a/2024/05/21/74b4d81a-1ca6-4e36-9ee9-b470f1871b49/img-3188.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-05-21T12:30:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.4767
  },
  {
    "title": "Microsoft's Build 2024: 10 quick developer focused announcements you need to know about",
    "description": "We explore ten developer offerings from Microsoft's Build 2024, with a big focus on adding AI to your developer toolkit.",
    "content": "Sabrina Ortiz/ZDNET It's time for a quick \"lightning round\" of developer features and enhancements Microsoft is announcing at Build 2024. Also: Every Copilot+ PC Microsoft just announced to take on Apple's M3 MacBooks Strap in, because we'll be movin... [10233 chars]",
    "url": "https://www.zdnet.com/article/microsofts-build-2024-10-quick-developer-focused-announcements-you-need-to-know-about/",
    "image": "https://www.zdnet.com/a/img/resize/e0d408243b3c50e8677f779c9673b9257c516b69/2024/05/21/c3a5362f-858a-4f9a-8cf9-afebfddb16f9/img-3176-720.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-05-21T12:30:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "How Microsoft's new AI Copilot features could transform teamwork and projects",
    "description": "Build 2024: Microsoft's new AI tools aim to enhance team collaboration, automate processes, and improve productivity. Here's how.",
    "content": "Sabrina Ortiz/ZDNET Microsoft has been working hard to integrate artificial intelligence into all its offerings and, for the most part, it has succeeded. Most of its integrations are provided under the overarching brand name of Copilot. There are Cop... [6981 chars]",
    "url": "https://www.zdnet.com/article/build-2024-microsoft-enhances-productivity-with-new-copilot-transforming-teamwork-and-projects/",
    "image": "https://www.zdnet.com/a/img/resize/d16601d51655d74d820de6a9268f99e27df00d10/2024/05/21/a80a9ff0-a802-4ac9-bcbd-697c3d380984/img-3179.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-05-21T12:30:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.6705
  },
  {
    "title": "Microsoft’s New Surface Laptops Are Here to Destroy the M3 MacBook Air",
    "description": "Microsoft introduced Copilot Plus PC laptops that use ARM chips and give the latest M3 MacBook Air some serious competition.",
    "content": "Apple’s M-series MacBooks might finally get some real competition. Microsoft announced its next generation of laptops under its new Copilot Plus PC umbrella, calling them the “fastest, most intelligent Windows PCs ever built.” As Apple did years ago,... [2607 chars]",
    "url": "https://www.inverse.com/tech/microsoft-copilot-plus-surface-laptop-price-release-date",
    "image": "https://imgix.bustle.com/uploads/image/2024/5/20/2c676913/surface-laptop-surface-pro.jpeg?w=1200&h=630&fit=crop&crop=focalpoint&fm=jpg&fp-x=0.4558&fp-y=0.6239",
    "publishedAt": "2024-05-20T20:00:25Z",
    "source": {
      "name": "Inverse",
      "url": "https://www.inverse.com"
    },
    "sentiment_score": 0.5095
  },
  {
    "title": "Snapdragon X Elite And Plus AI PCs From Major OEMs To Drive Microsoft Copilot+ Experiences",
    "description": "Microsoft is kicking off the Copilot+ PC era in partnership with Qualcomm, with several PC manufacturers on board.",
    "content": "Microsoft is looking to properly kick off the AI in PC era with its Copilot+ PC initiative the company is debuting at this year’s Microsoft Build conference, and Qualcomm will play a big role in the rollout. Qualcomm will be working with several hard... [1898 chars]",
    "url": "https://hothardware.com/news/snapdragon-x-elite-and-plus-ai-pcs-from-major-oems-to-drive-microsoft-copilot-experiences",
    "image": "https://images.hothardware.com/contentimages/newsitem/64608/content/qualcomm-snapdragon-copilot-hero.jpg",
    "publishedAt": "2024-05-20T19:00:00Z",
    "source": {
      "name": "Hot Hardware",
      "url": "https://hothardware.com"
    },
    "sentiment_score": 0.25
  },
  {
    "title": "Microsoft Surface and Copilot Event: Everything announced including new Surface laptops, Copilot+ PC and more",
    "description": "Microsoft revealed its grand vision of how to knit Windows and hardware more closely together and (surprise!) it's all rooted in AI. Here's everything the company announced at its Copilot and Surface event.",
    "content": "Microsoft just couldn't wait until its Build developer conference properly starts tomorrow to drop some knowledge bombs. The company held a pre-Build event on Monday that wasn't livestreamed for the public, but it made some major announcements on the... [7457 chars]",
    "url": "https://www.engadget.com/microsoft-surface-and-copilot-event-everything-announced-including-new-surface-laptops-copilot-pc-and-more-180709060.html",
    "image": "https://s.yimg.com/ny/api/res/1.2/e9PkGvUqn8iY5M_ZKr8qVw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/7db33ce0-16cd-11ef-bbfb-315a7655be4b",
    "publishedAt": "2024-05-20T18:42:56Z",
    "source": {
      "name": "Engadget",
      "url": "https://www.engadget.com"
    },
    "sentiment_score": -0.1406
  },
  {
    "title": "Microsoft Surface Event LIVE - All the Surface Pro 10 and Surface Laptop 6 news as it happens",
    "description": "Microsoft is unveiling new Surface hardware, and lots of news about AI, ahead of this year's Build 2024 conference kicking off tomorrow.",
    "content": "Refresh Take your seats (Image credit: Future) We're just roughly 15 minutes away from the big event, and we're all getting settled in ready for every announcement! Be sure to check in here live for every piece of news as it happens. Just as a remind... [9350 chars]",
    "url": "https://www.tomsguide.com/computing/live/microsoft-build-2024-live-blog",
    "image": "https://cdn.mos.cms.futurecdn.net/vz4W4wFh272NVWqTCU9eUJ-1200-80.jpg",
    "publishedAt": "2024-05-20T13:00:31Z",
    "source": {
      "name": "Tom's Guide",
      "url": "https://www.tomsguide.com"
    },
    "sentiment_score": 0.7712
  },
  {
    "title": "Microsoft's vs. Apple's AI computer strategies",
    "description": "Apple and Microsoft have been trying to integrate AI features into their applications but with different strategies. For the moment, Microsoft seems to be way ahead.",
    "content": "Join us in returning to NYC on June 5th to collaborate with executive leaders in exploring comprehensive methods for auditing AI models regarding bias, performance, and ethical compliance across diverse organizations. Find out how you can attend here... [5564 chars]",
    "url": "https://venturebeat.com/ai/inside-the-ai-integration-strategies-of-apple-and-microsoft/",
    "image": "https://venturebeat.com/wp-content/themes/vb-news/img/favicon.ico",
    "publishedAt": "2024-05-23T14:24:46Z",
    "source": {
      "name": "VentureBeat",
      "url": "https://venturebeat.com"
    },
    "sentiment_score": 0.7269
  },
  {
    "title": "Microsoft Build 2024: The biggest AI announcements and what they mean for you",
    "description": "Microsoft's Build keynote revealed a lot of new AI features for Windows users. Here's the ones that matter",
    "content": "Microsoft’s annual event for developers proved to be a treasure trove of AI-related news and features. First off, announcements don’t get much bigger than a new line of Windows PCs designed specifically for AI applications. Microsoft claims that its ... [3299 chars]",
    "url": "https://www.tomsguide.com/ai/microsoft-build-2024-the-biggest-ai-announcements-and-what-they-mean-for-you",
    "image": "https://cdn.mos.cms.futurecdn.net/fE8PX3PjtRMdywp6qgny8L-1200-80.png",
    "publishedAt": "2024-05-23T04:01:17Z",
    "source": {
      "name": "Tom's Guide",
      "url": "https://www.tomsguide.com"
    },
    "sentiment_score": 0.296
  },
  {
    "title": "How to use Microsoft Copilot",
    "description": "Microsoft Copilot is quite similar to ChatGPT, but it has a few key differences. Here's how to use it!",
    "content": "Microsoft Copilot is one of the best large language models (LLMs) available, and it's still one of the only free ways to experience GPT-4 right now. You can use it for advanced proofreading, research, learning, or even for meeting accessibility goals... [5634 chars]",
    "url": "https://www.xda-developers.com/how-to-use-microsoft-copilot/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/01/1000018122.jpg",
    "publishedAt": "2024-05-22T23:30:00Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.8591
  },
  {
    "title": "Microsoft Pledges to Use ‘Minecraft’ for Evil With Copilot AI",
    "description": "Microsoft recently demonstrated how it plans to integrate AI into games like 'Minecraft,' but the feature no one asked for has more problems than you might think.",
    "content": "Microsoft has been vocal lately about how its Copilot AI will soon be used on PCs — like spying on users and automating you out of a job — and now it’s shared plans for similar innovations coming to gaming. At its annual developer conference this wee... [4909 chars]",
    "url": "https://www.inverse.com/gaming/microsoft-copilot-ai-games-integration-minecraft",
    "image": "https://imgix.bustle.com/uploads/getty/2024/5/22/e8dee8cc/microsoft-corporate-vice-president.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg",
    "publishedAt": "2024-05-22T20:35:33Z",
    "source": {
      "name": "Inverse",
      "url": "https://www.inverse.com"
    },
    "sentiment_score": 0.5994
  },
  {
    "title": "Microsoft tries to assure Windows 11 users that Recall won't spy on them",
    "description": "The upcoming Recall feature for Windows 11 has been controversial due to its screenshot-taking capabilities, Microsoft is now trying to clear the air.",
    "content": "Key Takeaways Recall in Windows 11 is designed to take periodic screenshots for semantic search results, using AI capabilities locally on your device. Microsoft is reassuring users that they have full control over their Recall data, with options to c... [3912 chars]",
    "url": "https://www.xda-developers.com/microsoft-assure-windows-11-recall-spy/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/05/yusuf-mehdi-copilot-1.JPG",
    "publishedAt": "2024-05-22T16:27:49Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.4019
  },
  {
    "title": "Microsoft is deprecating VBScript in Windows, but it will still be available as an optional feature for years to come",
    "description": "Microsoft announced the deprecation of the ancient VBScript last year, but now it has revealed more detailed plans for this process.",
    "content": "Key Takeaways Microsoft is phasing out VBScript due to security concerns and better alternatives like JavaScript and PowerShell. VBScript capabilities will be available as features on demand (FODs) in Windows 11 version 24H2 and onward for the next f... [2321 chars]",
    "url": "https://www.xda-developers.com/microsoft-deprecating-vbscript-windows-available-optional-feature/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2023/12/visual-basic-6-desktop-splash.png",
    "publishedAt": "2024-05-22T15:36:20Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.743
  },
  {
    "title": "Buy Microsoft Office Pro 2021 and Windows 11 Pro bundled for $86 right now: Last chance",
    "description": "This lifetime license bundle deal gives you access to the entire Microsoft Office Pro 2021 suite and Windows 11 Pro for nearly 80% off.",
    "content": "Save big on this lifetime Microsoft Office Pro 2021 and Windows 11 Pro bundle. Kerry Wan/ZDNET It doesn't matter if you're upgrading to a new laptop or just upgrading your existing system -- access to Microsoft Office and Windows are necessities for ... [2462 chars]",
    "url": "https://www.zdnet.com/article/microsoft-office-pro-2021-windows-11-pro-deal/",
    "image": "https://www.zdnet.com/a/img/resize/7ac1faf0849d6b62b77428b9aac2dd03e1cca173/2023/07/10/db47e574-dfd2-481e-bfac-f68263f2b113/stacksocial-windows-11.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-05-22T13:30:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.4812
  },
  {
    "title": "Snapdragon X in Surface Laptops: Microsoft Promises Game-Changing Performance & Battery Life",
    "description": "Microsoft's latest Surface laptops boast Snapdragon X processors that reportedly outperform Apple's MacBook Air M3—learn more!",
    "content": "Microsoft has showcased its new Surface laptops with Qualcomm’s latest Snapdragon X series processors. These are ARM chips that make a big leap in performance when compared to Qualcomm’s previous offerings. The competition? Microsoft is going against... [3409 chars]",
    "url": "https://www.gizchina.com/2024/05/22/microsoft-says-surface-laptops-with-snapdragon-x-processors-are-over-50-faster-than-apple-macbook-air-m3/",
    "image": "https://www.gizchina.com/wp-content/uploads/images/2024/05/Microsoft-Surface-laptops-with-Snapdragon-X-1200x676.jpg",
    "publishedAt": "2024-05-22T11:21:59Z",
    "source": {
      "name": "Gizchina.com",
      "url": "https://www.gizchina.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Privacy regulators quiz Microsoft over Windows' incoming Recall AI feature",
    "description": "Privacy regulators in the U.K. and the EU have demanded answers from Microsoft about its Recall safeguards.",
    "content": "Yesterday I wrote about the potential winners and losers in Microsoft’s big push to sell powerful and energy-efficient AI PCs. But, while there was a lot to chew on with the hardware aspects, I failed to mention a major angle to the AI-ification of W... [7435 chars]",
    "url": "https://fortune.com/2024/05/22/microsoft-copilot-ai-pc-windows-privacy/",
    "image": "https://fortune.com/img-assets/wp-content/uploads/2024/05/GettyImages-2150291492_e77d7c-e1716385535594.jpg?resize=1200,600",
    "publishedAt": "2024-05-22T04:00:00Z",
    "source": {
      "name": "Fortune",
      "url": "https://fortune.com"
    },
    "sentiment_score": -0.5719
  },
  {
    "title": "Microsoft Edge will use AI to translate and dub YouTube and other videos in real time",
    "description": "Microsoft unveiled this week an AI-based video translation feature that will soon soon come to Edge. The feature will automatically generate foreign language transcriptions and dubs for...",
    "content": "Something to look forward to: Fast real-time translation is one key selling point that tech giants have used to push generative AI, and Microsoft will soon bake it into its Edge browser. While YouTube has been developing translation services for some... [2353 chars]",
    "url": "https://www.techspot.com/news/103094-microsoft-edge-use-ai-translate-dub-youtube-other.html",
    "image": "https://www.techspot.com/images2/news/bigimage/2024/01/2024-01-30-image-16.jpg",
    "publishedAt": "2024-05-22T00:47:00Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Intel Shows Readiness For Microsoft's Newest Phi-3 AI Models Across Entire CPU & GPU Portfolio",
    "description": "Intel announced support for Microsoft's Phi-3 AI models across its entire range of CPU and GPU product portfolio.",
    "content": "Intel announced support for Microsoft's Phi-3 AI models across its entire range of CPU and GPU product portfolio. Microsoft's Phi-3 Model Will Take Personalized AI Computing To a Whole New Level, Runs Well Across All CPU & GPU Products From Blue Team... [2222 chars]",
    "url": "https://wccftech.com/intel-readiness-for-microsofts-newest-phi-3-ai-models-across-entire-cpu-gpu-portfolio/",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2024/04/Intel-CEO-Pat-Gelsinger.jpeg",
    "publishedAt": "2024-05-25T17:31:35Z",
    "source": {
      "name": "Wccftech",
      "url": "https://wccftech.com"
    },
    "sentiment_score": 0.5859
  },
  {
    "title": "You can now give Microsoft Edge's AI-created themes a try",
    "description": "The new Microsoft Edge Beta is out, and with it comes AI-generated themes.",
    "content": "Key Takeaways The Microsoft Edge Beta branch now offers AI-generated themes for a unique browsing experience. Users can input a text prompt to generate a series of images as browser themes. To try out these themes, download the Microsoft Edge Insider... [1983 chars]",
    "url": "https://www.xda-developers.com/microsoft-edges-ai-created-theme-try/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2023/12/hp-envy-move-19.jpg",
    "publishedAt": "2024-05-24T23:03:50Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Truecaller partnered with Microsoft for AI voices",
    "description": "Microsoft is rapidly expanding its reach in the AI world, and that includes partnering with other companies. According to a new report, Microsoft",
    "content": "Microsoft is rapidly expanding its reach in the AI world, and that includes partnering with other companies. According to a new report, Microsoft partnered with Truecaller to create AI-generated assistants. These assistants will actually imitate your... [1678 chars]",
    "url": "https://www.androidheadlines.com/2024/05/truecaller-partners-microsoft-ai-voices.html",
    "image": "https://www.androidheadlines.com/wp-content/uploads/2024/05/Truecaller-Logo-jpg.webp",
    "publishedAt": "2024-05-24T18:33:03Z",
    "source": {
      "name": "Android Headlines",
      "url": "https://www.androidheadlines.com"
    },
    "sentiment_score": 0.296
  },
  {
    "title": "Google Set to Make Its Largest Acquisition Ever, Threatening Microsoft",
    "description": "Google's purchase of HubSpot is in line with its goal to 'take market share from Microsoft,' according to one analyst",
    "content": "Google parent Alphabet is reportedly making headway in its bid to acquire the $30 billion marketing software company HubSpot. That deal, which would be Google’s largest-ever acquisition, is part of the company’s strategy to compete with Microsoft in ... [1776 chars]",
    "url": "https://gizmodo.com/google-acquisition-hubspot-rival-microsoft-cloud-market-1851499164",
    "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/97cef0cc8ac226e184de9cde7cc1164f.jpg",
    "publishedAt": "2024-05-24T14:32:20Z",
    "source": {
      "name": "Gizmodo",
      "url": "https://gizmodo.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Surface Pro 11 vs Surface Pro 9: Is the 11 really that much better?",
    "description": "Find out if the new upgrades are truly worth skipping over the Surface Pro 10 name, as Microsoft went straight from the 9 to the 11",
    "content": "Microsoft Surface Pro 11 Microsoft’s new best 2-in-1 laptop The Surface Pro 11 offers some much-needed upgrades to Microsoft’s premiere 2-in-1 laptop line, including an optional OLED display, an impressive battery life, and up to 90% faster performan... [11662 chars]",
    "url": "https://www.xda-developers.com/microsoft-surface-pro-11-vs-surface-pro-9/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/05/surface-pro-11-vs-surface-pro-9.png",
    "publishedAt": "2024-05-24T14:30:13Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.8176
  },
  {
    "title": "Microsoft Office Professional 2021 for Windows is 77% off",
    "description": "Looking to save big on a work from home upgrade? Check out this great deal on Microsoft Office Professional 2021 for Windows, now available for 77% off.",
    "content": "Discover startups, services, products and more from our partner StackCommerce. New York Post edits this content, and may be compensated and/or receive an affiliate commission if you buy through our links. TL;DR: Accomplish more tasks in less time by ... [2399 chars]",
    "url": "https://nypost.com/2024/05/24/shopping/microsoft-office-professional-2021-for-windows-is-77-off/",
    "image": "https://nypost.com/wp-content/uploads/sites/2/2024/05/officefeat.jpg?quality=75&strip=all&w=1024",
    "publishedAt": "2024-05-24T13:00:00Z",
    "source": {
      "name": "New York Post",
      "url": "https://nypost.com"
    },
    "sentiment_score": 0.4215
  },
  {
    "title": "4 ways Microsoft’s Copilot+ PCs will reshape enterprise computing",
    "description": "What does Microsoft's Copilot+ PC mean for the enterprise? Microsoft execs and analysts to weigh in on this new AI computing reality.",
    "content": "Time's almost up! There's only one week left to request an invite to The AI Impact Tour on June 5th. Don't miss out on this incredible opportunity to explore various methods for auditing AI models. Find out how you can attend here. The era of the AI ... [15113 chars]",
    "url": "https://venturebeat.com/ai/how-microsofts-copilot-pcs-could-reshape-enterprise-computing/",
    "image": "https://venturebeat.com/wp-content/uploads/2024/05/DSC05762-2.jpg?w=1024?w=1200&strip=all",
    "publishedAt": "2024-05-24T12:33:16Z",
    "source": {
      "name": "VentureBeat",
      "url": "https://venturebeat.com"
    },
    "sentiment_score": 0.6629
  },
  {
    "title": "AMD Instinct MI300X Offers The Best Price To Performance on GPT-4 According To Microsoft, Red Team On-Track For 100x Perf/Watt By 2027",
    "description": "Microsoft's CEO has praised AMD's Instinct MI300X AI accelerators, stating they offer the best \"price-to-performance\" on the market.",
    "content": "Microsoft's CEO Satya Nadella has praised AMD's Instinct MI300X AI accelerators, stating they offer the best \"price-to-performance\" on the market. Microsoft's CEO Says That AMD's MI300X Delivers The Best Price-To-Performance Figures At GPT-4 At the B... [3372 chars]",
    "url": "https://wccftech.com/amd-instinct-mi300x-best-price-performance-gpt-4-microsoft-on-track-100x-perf-watt-2027/",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2023/06/AMD-Instinct-MI300-Exascale-APUs.jpeg",
    "publishedAt": "2024-05-24T12:00:08Z",
    "source": {
      "name": "Wccftech",
      "url": "https://wccftech.com"
    },
    "sentiment_score": 0.9118
  },
  {
    "title": "I interviewed Microsoft's Surface exec about Copilot+, the future of AI in Windows and how Apple factors in",
    "description": "Microsoft's Pete Kyriacou helps oversee Surface devices at Microsoft. In this interview, he explains where Copilot+ PCs are going, what the future of AI in Windows could look like and how Apple's MacBooks measure up.",
    "content": "The big Microsoft Build 2024 developer conference kicked off with a bang this week as company chief Satya Nadella introduced us to two new Surface products: The Surface Pro 11 and Surface Laptop 7. These are exciting devices because they're the first... [9766 chars]",
    "url": "https://www.tomsguide.com/computing/laptops/i-interviewed-microsofts-surface-exec-about-copilot-the-future-of-ai-in-windows-and-how-apple-factors-in",
    "image": "https://cdn.mos.cms.futurecdn.net/zu9fzj4v25oXniNdNfLkCD-1200-80.jpg",
    "publishedAt": "2024-05-24T07:01:20Z",
    "source": {
      "name": "Tom's Guide",
      "url": "https://www.tomsguide.com"
    },
    "sentiment_score": 0.4939
  },
  {
    "title": "Microsoft thinks it found a way to make PCs relevant again",
    "description": "Microsoft jumped headfirst into building artificial intelligence directly into its Windows operating system on Monday, announcing new AI computers at its annual developer conference in Seattle.",
    "content": "CNN — Microsoft jumped headfirst into building artificial intelligence directly into its Windows operating system on Monday, announcing new AI computers that could help ramp up flagging PC sales. The developments push the company closer to its long-t... [4280 chars]",
    "url": "https://edition.cnn.com/2024/05/21/tech/microsoft-ai-copilot-plus-build-2024/index.html",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/2024-05-01t084616z-2009033034-rc2fh7akbk4p-rtrmadp-3-microsoft-thailand.JPG?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-05-24T04:00:00Z",
    "source": {
      "name": "Cable News Network",
      "url": "https://edition.cnn.com"
    },
    "sentiment_score": 0.7003
  },
  {
    "title": "Microsoft's newest tactic to convert Windows 10 users is giving them a big comparison list",
    "description": "Microsoft believes that all Windows 10 users need is a little convincing, but people aren't jumping over for reasons far more complex than that.",
    "content": "Key Takeaways Microsoft attempts to push Windows 10 users to upgrade to Windows 11 by writing out a comparison list between the two. The tactic overlooks deeper issues like strict system requirements and privacy concerns. Microsoft may face challenge... [2499 chars]",
    "url": "https://www.xda-developers.com/microsoft-convert-windows-10-users-list/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2023/12/windows-10-laptop.jpg",
    "publishedAt": "2024-05-27T18:16:59Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.4215
  },
  {
    "title": "Surface Pro 11 vs MacBook Air: Can Microsoft Copilot+ unseat Apple?",
    "description": "The new Surface Pro 11 is seriously impressive, but is it worth considering over a laptop like the MacBook Air M3? Let's take a look.",
    "content": "Apple MacBook Air (M3, 2024) Practical choice $999 $1099 Save $100 The MacBook Air has long been regarded as one of the best laptops, and the new 2024 model brings some noteworthy upgrades. Its M3 Apple silicon CPU is powerful and efficient, and it's... [10680 chars]",
    "url": "https://www.xda-developers.com/surface-pro-11-vs-macbook-air/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/05/surface-pro-11-vs-macbook-air.jpg",
    "publishedAt": "2024-05-27T17:30:13Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.9186
  },
  {
    "title": "The buckets of AI and where Nvidia is crushing it",
    "description": "We have had a lot of AI news lately – product launches from OpenAI, Google, and Microsoft. Now we are just waiting for Apple and its upcoming...",
    "content": "We have had a lot of AI news lately – product launches from OpenAI, Google, and Microsoft. Now we are just waiting for Apple and its upcoming WWDC conference. Just last week, we wrote about how much of the industry was anticipating these announcement... [8240 chars]",
    "url": "https://www.techspot.com/news/103153-buckets-ai-where-nvidia-crushing.html",
    "image": "https://www.techspot.com/images2/news/bigimage/2024/05/2024-05-27-image-8.jpg",
    "publishedAt": "2024-05-27T16:36:11Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "AI Agents Promise to Connect the Dots Between Reality and Sci-Fi",
    "description": "Google, Microsoft, and OpenAI are all talking about how AI agents will revolutionize the future.",
    "content": "If you tuned in for Google I/O, OpenAI’s Spring Update, or Microsoft Build this month, you probably heard the term AI agents come up quite a lot in the last month. They’re quickly becoming the next big thing in tech, but what exactly are they? And wh... [5490 chars]",
    "url": "https://gizmodo.com/ai-agents-openai-chatgpt-google-gemini-reality-sci-fi-1851500474",
    "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/6ee6c9ec1189ca61f3faaf003ca5526c.jpg",
    "publishedAt": "2024-05-27T12:00:00Z",
    "source": {
      "name": "Gizmodo",
      "url": "https://gizmodo.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Tom's Guide asks: What would sell you on a Copilot+ PC?",
    "description": "Microsoft is rolling out some new Windows 11 AI features that are only available on Copilot+ PCs, the first of which start arriving June 18. Are they worth upgrading for?",
    "content": "Are newer, better AI features enough to sell you on buying a new laptop? Microsoft is certainly hoping so, as it unveiled a new tier of Windows 11 features this month that will only be available on select \"Copilot+ PCs\" which meet specific hardware r... [11119 chars]",
    "url": "https://www.tomsguide.com/computing/laptops/toms-guide-asks-what-would-sell-you-on-a-copilot-pc",
    "image": "https://cdn.mos.cms.futurecdn.net/9ZcgDu9KdRf7zqKAwofPoD-1200-80.jpg",
    "publishedAt": "2024-05-27T11:00:00Z",
    "source": {
      "name": "Tom's Guide",
      "url": "https://www.tomsguide.com"
    },
    "sentiment_score": 0.7964
  },
  {
    "title": "You're missing a lot if you haven't used these AI features in Microsoft Designer",
    "description": "Microsoft’s new AI-powered Canva alternative is worth giving a shot",
    "content": "Key Takeaways Use Microsoft Designer's AI tools with prompts and hashtags to effortlessly create compelling designs in no time. Experiment with image and design creator, sticker creator, and AI editing tools to elevate your creative work. Save time w... [5930 chars]",
    "url": "https://www.xda-developers.com/youre-missing-a-lot-if-you-havent-tried-these-microsoft-designer-features/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/05/microsoft-designer-must-have-features.jpg",
    "publishedAt": "2024-05-26T19:00:14Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.7845
  },
  {
    "title": "Is Microsoft Edge really that bad?",
    "description": "The default Windows browser’s poor reputation is evident, but does it deserve all the criticism?",
    "content": "Key Takeaways Microsoft Edge lags behind Chrome due to a cluttered homepage, overwhelming users with unnecessary features and settings. Edge boasts useful features like Sleep tabs and Collections, but also includes bloat like Microsoft Shopping, lead... [5367 chars]",
    "url": "https://www.xda-developers.com/is-microsoft-edge-really-that-bad/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/05/microsoft-edge-settings-to-tweak.jpg",
    "publishedAt": "2024-05-26T15:00:13Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.6369
  },
  {
    "title": "Microsoft Surface Pro 11 vs iPad Pro 2024: Which premium tablet could win?",
    "description": "The Microsoft Surface Pro 11 promises to be the best Surface Pro tablet yet, but can it take down the iPad Pro 2024?",
    "content": "The Microsoft Surface Pro 11 could be the most exciting Surface Pro in ages. Not only does it sport an OLED panel, but it also features the new Qualcomm Snapdragon X processors — both of which are firsts for the tablet line. The latter’s NPU (Neural ... [11772 chars]",
    "url": "https://www.tomsguide.com/tablets/microsoft-surface-pro-11-vs-ipad-pro-2024",
    "image": "https://cdn.mos.cms.futurecdn.net/nMzGqzPFJRtAYbGMn7QoDQ-1200-80.jpg",
    "publishedAt": "2024-05-26T12:35:54Z",
    "source": {
      "name": "Tom's Guide",
      "url": "https://www.tomsguide.com"
    },
    "sentiment_score": 0.3064
  },
  {
    "title": "Surface Laptop 7 vs the M3 MacBook Pro: Which is right for you?",
    "description": "Microsoft's latest ultralight or Apple's most premium laptop? Here's everything you need to know.",
    "content": "Surface Laptop 7 Microsoft's Surface Laptop 7 is a major overhaul to the Surface laptop line, sporting an all-new design with thinner bezels and an updated touchpad. You're also getting Snapdragon X Elite or X Plus chips, as opposed to the familiar I... [8115 chars]",
    "url": "https://www.xda-developers.com/surface-laptop-7-vs-macbook-pro-which-is-right-for-you/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/05/surfacelaptop7-vs-macbookpro.png",
    "publishedAt": "2024-05-26T12:00:13Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "For AI to Deliver on Its Promises, People Need to Trust It",
    "description": "Analysis: New tools from Google, Microsoft and others assume people are willing to trust AI to do the heavy lifting for them.",
    "content": "If Google, Microsoft and OpenAI are to be believed, artificial intelligence is going to revamp the way we work, communicate and generally use our phones and computers. All three tech giants held events over the last two weeks that were rife with demo... [10432 chars]",
    "url": "https://www.cnet.com/tech/mobile/for-ai-deliver-on-its-promises-people-need-to-trust-it/",
    "image": "https://www.cnet.com/a/img/resize/6fc4324872c27c24daf593013b634b9bcbeb6810/hub/2024/04/03/7b599a78-75e1-47e1-a0b7-bcf9bb251793/gettyimages-1498385993.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-05-26T09:00:00Z",
    "source": {
      "name": "CNET",
      "url": "https://www.cnet.com"
    },
    "sentiment_score": 0.4767
  },
  {
    "title": "How to use Microsoft Copilot in Telegram",
    "description": "Microsoft made Copilot available as a Telegram chatbot, and you can get it running on your device right now - here's how to use it.",
    "content": "I recently realized that I’ll soon chat more with AI like ChatGPT, Gemini, Copilot, and Apple’s chatbot than I do with humans. This is inevitable as these AI products become more personal, and they’ll be able to do more on my devices than simply answ... [4624 chars]",
    "url": "https://bgr.com/tech/microsoft-copilot-is-available-in-telegram-heres-how-to-use-it/",
    "image": "https://bgr.com/wp-content/uploads/2024/01/microsoft-copilot-button-2.jpg?quality=82&strip=all",
    "publishedAt": "2024-05-29T20:00:00Z",
    "source": {
      "name": "BGR",
      "url": "https://bgr.com"
    },
    "sentiment_score": 0.4144
  },
  {
    "title": "Microsoft aims to make Edge faster with the WebUI 2.0 project",
    "description": "Despite being part of every new Windows installation since 2015, Edge is still experiencing less-than-stellar popularity among PC users. Nevertheless, Microsoft is committed to investing significant development...",
    "content": "Something to look forward to: Microsoft is trying to make the Edge browser more responsive, especially for users on low-end devices. The WebUI 2.0 project is already providing some positive results now, and it should make the browser even better down... [2212 chars]",
    "url": "https://www.techspot.com/news/103185-microsoft-improving-edge-ui-responsiveness-webui-20-project.html",
    "image": "https://www.techspot.com/images2/news/bigimage/2024/05/2024-05-29-image-18.jpg",
    "publishedAt": "2024-05-29T19:46:00Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    },
    "sentiment_score": 0.8516
  },
  {
    "title": "Here are all the new features Microsoft added to Excel in May 2024",
    "description": "Here is the complete list of all new features Microsoft added to Excel this month.",
    "content": "Key Takeaways Excel for the web now allows users to filter comments like Mac clients, helping prioritize important feedback. Excel for Windows and Mac now supports regex functions natively, eliminating the need for third-party add-ins. Microsoft has ... [2498 chars]",
    "url": "https://www.xda-developers.com/microsoft-excel-new-features-may-2024/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/04/excel-enhanced.jpg",
    "publishedAt": "2024-05-29T06:12:41Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.9186
  },
  {
    "title": "Microsoft Copilot is invading your favorite chat apps",
    "description": "Microsoft's Copilot is now available on Telegram as a bot, but with some limitations.",
    "content": "It’s not just you — Microsoft is putting Copilot just about anywhere, and now it’s available on Telegram as a bot that’s part of its “copilot-for-social” project. Windows Latest reports that to use the bot, you’ll need to confirm your phone number by... [1900 chars]",
    "url": "https://www.digitaltrends.com/computing/microsoft-copilot-will-be-invading-telegram/",
    "image": "https://www.digitaltrends.com/wp-content/uploads/2021/10/telegram-app-iphone.jpg?resize=1200%2C630&p=1",
    "publishedAt": "2024-05-28T19:17:04Z",
    "source": {
      "name": "Digital Trends",
      "url": "https://www.digitaltrends.com"
    },
    "sentiment_score": 0.0772
  },
  {
    "title": "Copilot, Copilot Pro, and Copilot+ - breaking down Microsoft's confusing AI products",
    "description": "Understanding Microsoft's Copilot products isn't easy, so let's take a closer look at which of these products is.",
    "content": "Key Takeaways Microsoft's AI efforts with Copilot, Copilot Pro, and Copilot+ offer unique features catered to different user needs and preferences. Copilot Pro is a subscription service enhancing Copilot's capabilities, while Copilot+ focuses on AI t... [6519 chars]",
    "url": "https://www.xda-developers.com/copilot-vs-copilot-pro-vs-copilot-plus/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/05/copilot-24.JPG",
    "publishedAt": "2024-05-28T16:00:15Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Microsoft to offer next Call of Duty on subscription service in major shift forgame series",
    "description": "Microsoft inclusion of Call of Duty in its Xbox Game Pass subscription is a major shift for the game franchise. Read more here.",
    "content": "Microsoft (NASDAQ:MSFT) will release the latest installment of its Call of Duty video game series on its Xbox Game Pass subscription service, marking a major shift for the lucrative entertainment property. Call of Duty is one of the most successful v... [1514 chars]",
    "url": "https://seekingalpha.com/news/4110776-microsoft-to-offer-next-call-of-duty-on-subscription-service-marking-a-major-shift-for-the-lucrative-game-series",
    "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/458923739/image_458923739.jpg?io=getty-c-w750",
    "publishedAt": "2024-05-28T15:09:58Z",
    "source": {
      "name": "Seeking Alpha",
      "url": "https://seekingalpha.com"
    },
    "sentiment_score": 0.7841
  },
  {
    "title": "Buy Microsoft Project 2021 Pro or Microsoft Visio 2021 Pro for $30",
    "description": "Microsoft's project management solutions feature timesheet support, org charts, and more to help you stay organized -- and they're on sale now.",
    "content": "Get Microsoft Project 2021 Pro or Visio 2021 on sale right now. Stack Social Project management is the bread and butter of the professional world, but actually getting things done can be a challenge. Professional software can optimize many operations... [1819 chars]",
    "url": "https://www.zdnet.com/article/microsoft-project-pro-deal-microsoft-visio-deal/",
    "image": "https://www.zdnet.com/a/img/resize/5cbfa617224d87d72d23e67a28aa143497edb72e/2024/04/11/5d3ec3bb-ee61-47bf-86d6-2ff6397ec46a/microsoft-project-removebg-preview.png?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-05-28T12:00:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.6956
  },
  {
    "title": "Microsoft Office 2021 is $49.97 for life for Memorial Day",
    "description": "Skip the recurring Microsoft 365 subscription and get lifetime access to Microsoft Office 2021, which includes Word, Excel, PoweRPoint, OneNote, Outlook, Publisher, Access, and Teams for $49.97.",
    "content": "We hope you enjoy ClickOnDeals, brought to you in connection with StackSocial . WDIV receives an affiliate commission if you buy through our links. Paying every month for software you’ll always need is like renting your own productivity. Subscription... [1645 chars]",
    "url": "https://www.clickondetroit.com/deals/2024/05/28/microsoft-office-2021-is-4997-for-life-for-memorial-day/",
    "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/IDCK3E57AVHJ3PJDH4QGCSPLJU.jpg?_a=ATAPphC0",
    "publishedAt": "2024-05-28T11:00:00Z",
    "source": {
      "name": "WDIV ClickOnDetroit",
      "url": "https://www.clickondetroit.com"
    },
    "sentiment_score": 0.8225
  },
  {
    "title": "Microsoft OneNote could finally get the long awaited Reminders feature",
    "description": "We've spotted strings within OneNote that indicate that Microsoft is working to add reminder functionality to the app. Read on for more!",
    "content": "Aamir Siddiqui / Android Authority TL;DR Microsoft OneNote is popular for note-taking but lacks a reminder feature. Users have had to use other apps like Microsoft To Do for reminder functionality. We’ve spotted strings within the app’s latest beta t... [2243 chars]",
    "url": "https://www.androidauthority.com/microsoft-onenote-reminder-feature-apk-teardown-3446568/",
    "image": "https://www.androidauthority.com/wp-content/uploads/2024/05/Microsoft-OneNote.jpg",
    "publishedAt": "2024-05-28T10:20:24Z",
    "source": {
      "name": "Android Authority",
      "url": "https://www.androidauthority.com"
    },
    "sentiment_score": 0.6486
  },
  {
    "title": "Buy Microsoft Visual Studio Pro for 91% off right now",
    "description": "Code faster and work smarter with a license to Microsoft Visual Studio Professional 2022, which is currently $40.",
    "content": "Amplify your dev work with this deal on Visual Studio Pro 2022 right now. StackSocial Having in-house development is a massive advantage for many businesses. And having software on hand to help streamline workflows, amplify productivity, and keep pro... [1080 chars]",
    "url": "https://www.zdnet.com/article/microsoft-visual-studio-pro-deal/",
    "image": "https://www.zdnet.com/a/img/resize/a0c6c52be3bb558cd4187571a253dc13d3852632/2024/01/30/111c2f53-46fc-4583-aabe-f894f2f50483/sale-323957-article-image.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-05-28T08:00:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.7845
  },
  {
    "title": "Microsoft is working on an AI-powered Edge feature that may make your life easier",
    "description": "While nothing has been outright confirmed, there are hints that Microsoft wants to revolutionize how you browse using AI.",
    "content": "Key Takeaways Microsoft Edge may soon use AI to suggest websites based on your browsing habits. New code in Edge hints at AI features that predict top sites for users. While features are still in development, Microsoft may expand AI integration in th... [2040 chars]",
    "url": "https://www.xda-developers.com/microsoft-iai-powered-edge-feature-browsing-easier/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2023/12/hp-envy-move-19.jpg",
    "publishedAt": "2024-05-31T23:12:52Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.4767
  },
  {
    "title": ".NET framework brought to life on the NES console by Microsoft programmer",
    "description": "During this year's Build conference, Microsoft programmer Jon Peppers introduced his pet coding project, demonstrating how he ported .NET technology to the Nintendo Entertainment System. The \".NES\"...",
    "content": "Through the looking glass: The .NET framework was originally developed by Microsoft in the early 2000s to simplify software development on Windows. The technology was later ported to other computing platforms, but now resourceful coders are starting ... [2062 chars]",
    "url": "https://www.techspot.com/news/103209-net-framework-brought-life-nes-console-microsoft-programmer.html",
    "image": "https://www.techspot.com/images2/news/bigimage/2024/05/2024-05-31-image-3.png",
    "publishedAt": "2024-05-31T14:27:00Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "This $1,900 laptop ditches the physical display for a pair of AR glasses",
    "description": "After nearly three years in development by veterans from Apple, Microsoft, and Magic Leap, the Spacetop G1 is finally emerging from an invite-only early access period, and...",
    "content": "WTF?! Laptops are going for all sorts of crazy designs these days in a bid to stand out. You may have heard about those with foldable and transparent displays, but what about one with no display whatsoever? Sightful has just unveiled the Spacetop G1 ... [2792 chars]",
    "url": "https://www.techspot.com/news/103205-1900-laptop-ditches-physical-display-pair-ar-glasses.html",
    "image": "https://www.techspot.com/images2/news/bigimage/2024/05/2024-05-31-image-4.jpg",
    "publishedAt": "2024-05-31T11:15:00Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    },
    "sentiment_score": -0.4057
  },
  {
    "title": "You Can Now Talk to Copilot In Telegram",
    "description": "Telegram has teamed up with Microsoft to offer Copilot in the app. It doesn't do anything different than the other versions of Copilot, but you don't have to leave the app to use it.",
    "content": "Credit: Primakov/Shutterstock Generative AI applications like ChatGPT, Gemini, and Copilot are known as chatbots, since you're meant to talk to them. So, I guess it's only natural that chat apps would want to add chatbots to their platforms—whether o... [3006 chars]",
    "url": "https://lifehacker.com/tech/copilot-is-now-in-telegram",
    "image": "https://lifehacker.com/imagery/articles/01HZ5GP5NH0J0WS477CB7YATR1/hero-image.fill.size_1200x675.png",
    "publishedAt": "2024-05-30T22:00:00Z",
    "source": {
      "name": "Lifehacker",
      "url": "https://lifehacker.com"
    },
    "sentiment_score": 0.7845
  },
  {
    "title": "How to annotate a webpage on your computer or phone",
    "description": "Google Chrome, Microsoft Edge, and Firefox allow you to annotate a webpage either natively or with an extension. Here's how to take notes on a page.",
    "content": "There are many ways to take notes on computers and mobile phones, but annotating a web page keeps your notes in a relevant place. This functionality isn't built into most web browsers, so third-party extensions have filled the gap. These extensions t... [4844 chars]",
    "url": "https://www.androidpolice.com/how-to-annotate-a-webpage/",
    "image": "https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/04/notes-shortcut.jpg",
    "publishedAt": "2024-05-30T07:49:12Z",
    "source": {
      "name": "Android Police",
      "url": "https://www.androidpolice.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Buy Microsoft Office 2021 for Windows for $50 right now",
    "description": "Pay once and get a lifetime license to the Microsoft Office 2021 app suite (including Word, Excel, and PowerPoint) on your PC (there's a deal for a Mac version, too).",
    "content": "'ZDNET Recommends': What exactly does it mean? ZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other rele... [1148 chars]",
    "url": "https://www.zdnet.com/article/microsoft-office-professional-2021-deal/",
    "image": "https://www.zdnet.com/a/img/resize/8f46da59db901138ae529611f64e6c2d409f0cdc/2022/03/11/5bdbbf3c-74b9-43d5-8bc0-d98914f5d06b/zd-microsoft-office.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-06-02T11:00:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.802
  },
  {
    "title": "Microsoft's tale of two techs: Their hardware heroes and software struggles",
    "description": "Microsoft itself doesn’t offer slick native apps on Windows, so how can they expect third-party developers to do so?",
    "content": "Key Takeaways Microsoft excels in hardware innovation, but falls short in software execution with many apps based on web technology. First-party apps like Outlook and Clipchamp lack native UI, resulting in inconsistent user experience and degraded pe... [5384 chars]",
    "url": "https://www.xda-developers.com/microsofts-tale-of-two-teams-hardware-heroes-and-software-struggles/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/05/surface-laptop-7-6.jpg",
    "publishedAt": "2024-06-01T21:00:16Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": -0.09
  },
  {
    "title": "Microsoft re-opens the beta branch for Windows 10, but the end-of-life date isn't changing",
    "description": "Microsoft wants people to help test new Windows 10 features, but don't expect it to last forever.",
    "content": "Key Takeaways Microsoft re-opens Beta branch for Windows 10. Joining the Beta Insider branch won't extend Windows 10 support beyond 2025. Extended Security Update won't bring new features, just security fixes. Don't get too excited, but Microsoft may... [1899 chars]",
    "url": "https://www.xda-developers.com/microsoft-re-opens-beta-branch-windows-10/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2024/05/every-windows-wallpaper-featured.jpg",
    "publishedAt": "2024-06-04T23:00:45Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.3555
  },
  {
    "title": "Researcher says Microsoft's Windows Recall has security gaps \"you can fly a plane through\"",
    "description": "Windows Recall stirred up controversy the moment Microsoft announced it, and with good reason. The feature is rolling out with the upcoming Copilot+ PCs and will constantly...",
    "content": "Windows Recall: Microsoft says it's secure; security researchers say it's not, but does it matter? Windows Recall is a feature that takes screenshots of every moment you are on your computer to make that information available for Copilot searches. Is... [4068 chars]",
    "url": "https://www.techspot.com/news/103258-researcher-microsoft-windows-recall-has-security-gaps-you.html",
    "image": "https://www.techspot.com/images2/news/bigimage/2024/06/2024-06-04-image-27.jpg",
    "publishedAt": "2024-06-04T19:20:00Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    },
    "sentiment_score": 0.3716
  },
  {
    "title": "Microsoft should stop pretending that Windows 10 users don't know Windows 11 exists",
    "description": "Microsoft has tried teaching the Windows 10 crowd, but it hasn't done much. Now it needs a reason for people to upgrade to Windows 11.",
    "content": "Key Takeaways Windows 10 users aren't upgrading; not because they are unaware of Windows 11, but because they've chosen not to make the switch. Microsoft's focus on showcasing Windows 11's features and the upgrade process won't be enough to convince ... [5999 chars]",
    "url": "https://www.xda-developers.com/microsoft-stop-pretending-windows-10-users-dont-know-windows-11/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2023/12/windows-11-and-windows-10.jpg",
    "publishedAt": "2024-06-04T15:00:14Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.2732
  },
  {
    "title": "Microsoft announces layoffs and restructuring in its mixed reality division",
    "description": "Microsoft is laying off employees working on mixed reality as part of a restructuring of the division.",
    "content": "It will keep selling the HoloLens 2, however. Microsoft is laying off employees working on mixed reality as part of a restructuring of the division, CNBC has reported. The company will continue to sell the HoloLens 2 augmented reality (AR) headset, a... [1663 chars]",
    "url": "https://www.engadget.com/microsoft-announces-layoffs-and-restructuring-in-its-mixed-reality-division-120042170.html",
    "image": "https://s.yimg.com/os/creatr-uploaded-images/2024-06/92c34610-224a-11ef-bfbd-7506ea09b843",
    "publishedAt": "2024-06-04T12:00:42Z",
    "source": {
      "name": "Engadget",
      "url": "https://www.engadget.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "SAP embeds its Joule AI copilot into more apps, plans Microsoft Copilot tie-up",
    "description": "SAP is embedding Joule in Ariba and Analytics Cloud to manage spending and business intelligence. Its AI copilot will also soon support Microsoft Copilot.",
    "content": "Time's almost up! There's only one week left to request an invite to The AI Impact Tour on June 5th. Don't miss out on this incredible opportunity to explore various methods for auditing AI models. Find out how you can attend here. SAP is moving full... [4606 chars]",
    "url": "https://venturebeat.com/ai/sap-to-embed-joule-ai-copilot-into-more-of-its-enterprise-apps-plans-microsoft-copilot-tie-up/",
    "image": "https://venturebeat.com/wp-content/uploads/2024/06/adobe-firefly-network-cloud-graphic-data-tables.jpg?w=1024?w=1200&strip=all",
    "publishedAt": "2024-06-04T12:00:00Z",
    "source": {
      "name": "VentureBeat",
      "url": "https://venturebeat.com"
    },
    "sentiment_score": 0.6629
  },
  {
    "title": "Microsoft has warped the PC world into something unrecognizable",
    "description": "Computex proved that Microsoft has a lot more power over AMD and Intel than we normally give it credit for.",
    "content": "Microsoft has often taken a backseat in driving the direction of the PC industry. But that time is over. Over the past couple of weeks, we’ve had a front row seat in seeing just how much power Microsoft has within the PC industry. Of course, developi... [6039 chars]",
    "url": "https://www.digitaltrends.com/computing/microsoft-is-warping-the-pc-industry/",
    "image": "https://www.digitaltrends.com/wp-content/uploads/2024/05/copilot-pcs-01.jpg?resize=1200%2C630&p=1",
    "publishedAt": "2024-06-04T11:30:42Z",
    "source": {
      "name": "Digital Trends",
      "url": "https://www.digitaltrends.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Kremlin Denies Spreading Disinformation About Paris Olympics—Calls Microsoft’s Claims ‘Slander’",
    "description": "Microsoft said in a report Russia was “ramping up malign disinformation campaigns” against France and the Olympics.",
    "content": "Topline Microsoft’s claims that Russia is targeting France and the upcoming Paris Olympics with an online disinformation campaign is “absolute slander,” the Kremlin said Tuesday, following a report from the company indicating Russia-affiliated groups... [2740 chars]",
    "url": "https://www.forbes.com/sites/tylerroush/2024/06/04/kremlin-denies-its-spreading-disinformation-about-paris-olympics-calls-microsofts-claims-slander/",
    "image": "https://imageio.forbes.com/specials-images/imageserve/665f0c1c82685f3d962a3883/0x0.jpg?format=jpg&crop=3177,1786,x0,y19,safe&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-06-04T04:00:00Z",
    "source": {
      "name": "Forbes",
      "url": "https://www.forbes.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Microsoft confirms mixed reality layoffs, will keep selling HoloLens 2",
    "description": "Microsoft is investing billions to put in place graphics processing units for generative artificial intelligence. It's slowing investment in other areas.",
    "content": "Microsoft CEO Satya Nadella speaks at a media briefing at the company's campus in Redmond, Washington, on May 20, 2024. Microsoft will lay off some employees who work on mixed reality, a spokesperson told CNBC on Monday. Although the cuts will affect... [2835 chars]",
    "url": "https://www.cnbc.com/2024/06/03/microsoft-confirms-mixed-reality-layoffs-will-keep-selling-hololens-2.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107423519-1717442844330-gettyimages-2153349224-MICROSOFT_AI_PC.jpeg?v=1717442940&w=1920&h=1080",
    "publishedAt": "2024-06-03T19:44:18Z",
    "source": {
      "name": "CNBC",
      "url": "https://www.cnbc.com"
    },
    "sentiment_score": -0.296
  },
  {
    "title": "Microsoft’s hallmark AI feature dubbed a security ‘disaster’ days before WWDC",
    "description": "Microsoft made an impressive presentation with Copilot Plus PCs, and their new AI-centric Recall feature, but now things don’t look so good.",
    "content": "Microsoft has a target on Apple’s back with its AI-centric Copilot Plus PC models. When the computers were announced, the company repeatedly claimed that they outperformed the latest M3 MacBook Airs. Today a new ad campaign sought to further entice s... [2770 chars]",
    "url": "https://9to5mac.com/2024/06/03/microsoft-ai-feature-dubbed-a-security-disaster/",
    "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/05/surface-copilot-pcs.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "publishedAt": "2024-06-03T16:30:08Z",
    "source": {
      "name": "9to5Mac",
      "url": "https://9to5mac.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Microsoft Roadmap Weekly: Major enhancements scheduled for Teams, a wealth of new features for Copilot, and more",
    "description": "Here are all the new features Microsoft added to its roadmap website last week",
    "content": "Key Takeaways Microsoft Teams feature to export Q&A questions for easy follow-up and task assignment (ID: 398446). Keep channel lists relevant with Teams' automatic hide feature (ID: 325780) coming in July. Copilot in Microsoft Teams will soon allow ... [4500 chars]",
    "url": "https://www.xda-developers.com/microsoft-roadmap-weekly-new-features-june-3/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2023/09/cancel-microsoft-365.png",
    "publishedAt": "2024-06-03T15:00:14Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.4767
  },
  {
    "title": "Big AI is finally in the antitrust hot seat. Here's what that means",
    "description": "Microsoft, Nvidia, and OpenAI are reportedly being investigated by the DOJ and FTC over alleged monopolistic behavior",
    "content": "Tech giants have been on an artificial intelligence spending spree, doling out billions of dollars to invest in, poach from, and gobble up smaller companies developing the world’s AI technology. Amazon has poured $4 billion into AI startup Anthropic ... [5976 chars]",
    "url": "https://qz.com/microsoft-nvidia-and-openai-big-ai-antitrust-investiga-1851524938",
    "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/3c71708e22c5495a164e3e493713ed5d.jpg",
    "publishedAt": "2024-06-06T22:38:00Z",
    "source": {
      "name": "Quartz India",
      "url": "https://qz.com"
    },
    "sentiment_score": 0.5859
  },
  {
    "title": "FTC launches an antitrust probe into Microsoft's deal with Inflection AI",
    "description": "The FTC is investigating whether Microsoft structured a deal with Inflection AI to dodge regulatory review.",
    "content": "Microsoft is under investigation by the Federal Trade Commission over its deal with Inflection AI, according to The Wall Street Journal. Back in March, the company hired almost all of Inflection AI's employees, including founders Karén Simonyan and M... [1984 chars]",
    "url": "https://www.engadget.com/ftc-launches-an-antitrust-probe-into-microsofts-deal-with-inflection-ai-130038896.html",
    "image": "https://s.yimg.com/ny/api/res/1.2/5Oa_jqkKSIkXRnOcOAzRqw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-images/2019-11/9f16ceb0-ff1c-11e9-ab2b-ffa8217cdf8a",
    "publishedAt": "2024-06-06T12:40:38Z",
    "source": {
      "name": "Engadget",
      "url": "https://www.engadget.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Microsoft, Nvidia, and OpenAI to face U.S. antitrust probe",
    "description": "The DOJ and FTC have reached a deal to scrutinize the firms' dominance of the AI industry",
    "content": "The rapid rise of artificial intelligence has been led by a few key players in the tech world: Microsoft, OpenAI, and chipmaker Nvidia. Now, they’re all coming under federal scrutiny for their outsized dominance of the market. Softening jobs market c... [2501 chars]",
    "url": "https://qz.com/microsoft-nvidia-openai-doj-ftc-investigation-antitrust-1851522748",
    "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/92e021c0a1dd357a5d8c23f6921f81a9.jpg",
    "publishedAt": "2024-06-06T12:19:00Z",
    "source": {
      "name": "Quartz India",
      "url": "https://qz.com"
    },
    "sentiment_score": 0.5994
  },
  {
    "title": "Microsoft adds new features to Outlook for iOS and Android, a bunch more coming soon",
    "description": "Microsoft has rolled out updates for its mobile apps on iOS and Android, which bring several new features and improvements.",
    "content": "iOS New features Added a new \"Report Message\" to the swipe action list. Added local account support for Box. Improvements Compose - You can now resend messages from the Sent folder. Calendar - Teams meeting chat is now available from the event detail... [2022 chars]",
    "url": "https://www.phonearena.com/news/microsoft-ios-android-update-new-features_id159139",
    "image": "https://m-cdn.phonearena.com/images/article/159139-wide-two_1200/Microsoft-adds-new-features-to-Outlook-for-iOS-and-Android-a-bunch-more-coming-soon.jpg",
    "publishedAt": "2024-06-06T12:17:59Z",
    "source": {
      "name": "PhoneArena",
      "url": "https://www.phonearena.com"
    },
    "sentiment_score": 0.6124
  },
  {
    "title": "Microsoft’s AI deal under federal investigation",
    "description": "The Federal Trade Commission is investigating a recent Microsoft deal with artificial intelligence startup Inflection, according to a person familiar with the matter, as US antitrust regulators ramp up scrutiny of the red-hot AI industry.",
    "content": "Washington CNN — The Federal Trade Commission is investigating a recent Microsoft deal with artificial intelligence startup Inflection, according to a person familiar with the matter, as US antitrust regulators ramp up scrutiny of the red-hot AI indu... [2698 chars]",
    "url": "https://edition.cnn.com/2024/06/06/tech/ftc-microsofts-ai-investigation/index.html",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap24158234902073.jpg?c=16x9&q=w_800,c_fill",
    "publishedAt": "2024-06-06T12:08:28Z",
    "source": {
      "name": "Cable News Network",
      "url": "https://edition.cnn.com"
    },
    "sentiment_score": 0.4939
  },
  {
    "title": "U.S. regulators to open antitrust inquiries of Microsoft, OpenAI and Nvidia, says report",
    "description": "U.S. regulators have reportedly reached a deal that allows them to proceed with antitrust investigations into the roles Microsoft, OpenAI and Nvidia play in AI.",
    "content": "The U.S. Justice Department and the Federal Trade Commission have reached a deal that allows them to proceed with antitrust investigations into the dominant roles that Microsoft , OpenAI and Nvidia play in the artificial intelligence industry, the Ne... [1711 chars]",
    "url": "https://www.cnbc.com/2024/06/06/us-regulators-to-open-antitrust-inquiries-of-microsoft-openai-and-nvidia-says-report.html",
    "image": "https://image.cnbcfm.com/api/v1/image/107249282-1685629494075-gettyimages-1258297673-arriens-aiillust230530_npLpV.jpeg?v=1717674291&w=1920&h=1080",
    "publishedAt": "2024-06-06T11:45:18Z",
    "source": {
      "name": "CNBC",
      "url": "https://www.cnbc.com"
    },
    "sentiment_score": 0.8519
  },
  {
    "title": "Antitrust police going after Nvidia, Microsoft and OpenAI - NYT",
    "description": "The fresh probe into Nvidia (NVDA), Microsoft (MSFT) and Microsoft-backed OpenAI will explore the dominant roles the companies play in the AI industry.",
    "content": "The exclusive $3T market cap club has a new member... and a new antitrust investigation. The fresh probe into Nvidia (NASDAQ:NVDA), Microsoft (NASDAQ:MSFT) and Microsoft-backed OpenAI will explore the dominant roles the companies play in the artifici... [1802 chars]",
    "url": "https://seekingalpha.com/news/4113434-antitrust-police-going-after-nvidia-microsoft-and-openai-nyt",
    "image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1212191861/image_1212191861.jpg?io=getty-c-w750",
    "publishedAt": "2024-06-06T07:48:02Z",
    "source": {
      "name": "Seeking Alpha",
      "url": "https://seekingalpha.com"
    },
    "sentiment_score": 0.6369
  },
  {
    "title": "Microsoft’s Deal With Inflection AI Under Antirust Investigation, Report Says",
    "description": "In March, Inflection’s co-founder and CEO joined Microsoft with nearly all of the company’s employees as part of a deal in which the tech giant did not buy the startup outright.",
    "content": "Topline The Federal Trade Commission is probing Microsoft’s recent deal with artificial intelligence startup Inflection AI to examine if the tech giant deliberately structured it in a manner that would avoid an antitrust review, the Wall Street Journ... [3121 chars]",
    "url": "https://www.forbes.com/sites/siladityaray/2024/06/06/ftc-is-reportedly-probing-microsofts-deal-with-inflection-ai/",
    "image": "https://imageio.forbes.com/specials-images/imageserve/66616311b2fc1255de42c0d1/0x0.jpg?format=jpg&crop=1978,1113,x0,y17,safe&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-06-06T04:00:00Z",
    "source": {
      "name": "Forbes",
      "url": "https://www.forbes.com"
    },
    "sentiment_score": 0.2263
  },
  {
    "title": "Microsoft's AI Recall Gets Backlash From Security Experts",
    "description": "Some are calling for Microsoft to recall its Recall feature before it creates a security crisis.",
    "content": "It's only been two weeks since Microsoft unveiled Windows Recall as a key feature of its Copilot artificial intelligence tool, but the software feature is already being blasted by security experts. The feature, which tracks all activity on a Windows ... [2676 chars]",
    "url": "https://www.cnet.com/tech/services-and-software/microsofts-ai-recall-gets-backlash-from-security-experts/",
    "image": "https://www.cnet.com/a/img/resize/862bb9d29efb45874d650033e330d0d1cfa4e4da/hub/2024/01/09/614d7418-5e46-4dec-ab37-8492dadb56ba/ai-key-keyboard-14.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-06-05T19:20:00Z",
    "source": {
      "name": "CNET",
      "url": "https://www.cnet.com"
    },
    "sentiment_score": 0.631
  },
  {
    "title": "This is the most important showcase in Xbox’s history",
    "description": "Streaming on June 9 after studio closures and the Activision acquisition, Microsoft needs to show fans more than COD: Black Ops 6 and an Xbox handheld.",
    "content": "In theory, Microsoft approaches this week’s Summer Game Fest and the annual Xbox showcase on June 9 from a position of fantastic strength: Microsoft’s acquisition of Activision Blizzard has supercharged the revenues of its gaming division and turned ... [6851 chars]",
    "url": "https://www.polygon.com/24171899/xbox-showcase-2024-preview-analysis",
    "image": "https://cdn.vox-cdn.com/thumbor/kgW4MIeRfgy3jpX5xbyDp-w-BqI=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23179057/jbareham_220118_ecl1087_stock_xbox.jpg",
    "publishedAt": "2024-06-05T16:33:08Z",
    "source": {
      "name": "Polygon",
      "url": "https://www.polygon.com"
    },
    "sentiment_score": 0.7783
  },
  {
    "title": "Here's How Microsoft's AI Super Resolution Works To Amp Game Frame Rate",
    "description": "Microsoft is baking its own resolution upscaling solution directly into Windows, which will eventually allow it to work with a multitude of games.",
    "content": "Microsoft is bringing its own AI based super resolution technique, dubbed Automatic super resolution (Auto SR), to the masses by baking it right into Windows. Like other solutions from AMD, Intel and NVIDIA, Microsoft's solution takes a game rendered... [1676 chars]",
    "url": "https://hothardware.com/news/heres-how-microsofts-ai-super-resolution-works",
    "image": "https://images.hothardware.com/contentimages/newsitem/64744/content/microsoft-autosr-hero.jpg",
    "publishedAt": "2024-06-08T18:32:00Z",
    "source": {
      "name": "Hot Hardware",
      "url": "https://hothardware.com"
    },
    "sentiment_score": 0.9231
  },
  {
    "title": "Grab Microsoft Office Pro 2021 and Windows 11 Pro for just $60",
    "description": "This lifetime license bundle deal gives you access to the entire Microsoft Office Pro 2021 suite and Windows 11 Pro for 86% off.",
    "content": "Save big on this lifetime Microsoft Office Pro 2021 and Windows 11 Pro bundle. Kerry Wan/ZDNET It doesn't matter if you're upgrading to a new laptop or just upgrading your existing system -- access to Microsoft Office and Windows is a necessity for g... [2423 chars]",
    "url": "https://www.zdnet.com/article/grab-microsoft-office-pro-2021-and-windows-11-pro-for-just-60/",
    "image": "https://www.zdnet.com/a/img/resize/7ac1faf0849d6b62b77428b9aac2dd03e1cca173/2023/07/10/db47e574-dfd2-481e-bfac-f68263f2b113/stacksocial-windows-11.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-06-08T12:00:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.4812
  },
  {
    "title": "Microsoft's New 'Recall' Feature Is Equal Parts Cool and Dangerous",
    "description": "As part of its Copilot+ PC event, Microsoft revealed a new feature called Recall, which takes screenshots of nearly everything you do on Windows 11, so you can search for a specific activity later on. But the feature comes with some major security risks.",
    "content": "We may earn a commission from links on this page. Credit: Windows/YouTube We take the search function for granted—when it goes well. If you search for a particular email, photo, or document on your PC, and it pops right up, you don't think twice abou... [7138 chars]",
    "url": "https://lifehacker.com/tech/microsofts-new-recall-feature-is-equal-parts-cool-and-dangerous",
    "image": "https://lifehacker.com/imagery/articles/01HYEBTYH79FHJR1V40GPWSPQC/hero-image.fill.size_1200x675.jpg",
    "publishedAt": "2024-06-07T23:30:00Z",
    "source": {
      "name": "Lifehacker",
      "url": "https://lifehacker.com"
    },
    "sentiment_score": 0.5719
  },
  {
    "title": "Microsoft's Recall feature will now be opt-in and double encrypted after privacy outcry",
    "description": "Microsoft temporarily disables its AI-powered Recall feature on Copilot+ PCs following privacy and security concerns raised by cybersecurity experts and the public.",
    "content": "VB Transform 2024 returns this July! Over 400 enterprise leaders will gather in San Francisco from July 9-11 to dive into the advancement of GenAI strategies and engaging in thought-provoking discussions within the community. Find out how you can att... [5295 chars]",
    "url": "https://venturebeat.com/ai/microsofts-recall-feature-will-now-be-opt-in-and-double-encrypted-after-privacy-outcry/",
    "image": "https://venturebeat.com/wp-content/uploads/2024/06/nuneybits_Vector_art_of_Microsoft_pulls_the_plug_1b0c5a94-d017-452b-8c03-ff79f0403ba5.webp?w=1024?w=1200&strip=all",
    "publishedAt": "2024-06-07T20:49:28Z",
    "source": {
      "name": "VentureBeat",
      "url": "https://venturebeat.com"
    },
    "sentiment_score": 0.4003
  },
  {
    "title": "Microsoft's Recall feature will now be opt-in and double encrypted after privacy outcry",
    "description": "Microsoft temporarily disables its AI-powered Recall feature on Copilot+ PCs following privacy and security concerns raised by cybersecurity experts and the public.",
    "content": "VB Transform 2024 returns this July! Over 400 enterprise leaders will gather in San Francisco from July 9-11 to dive into the advancement of GenAI strategies and engaging in thought-provoking discussions within the community. Find out how you can att... [5295 chars]",
    "url": "https://venturebeat.com/ai/microsoft-temporarily-disables-recall-on-copilot-pcs-amid-security-and-privacy-concerns/",
    "image": "https://venturebeat.com/wp-content/uploads/2024/06/nuneybits_Vector_art_of_Microsoft_pulls_the_plug_1b0c5a94-d017-452b-8c03-ff79f0403ba5.webp?w=1024?w=1200&strip=all",
    "publishedAt": "2024-06-07T20:49:28Z",
    "source": {
      "name": "VentureBeat",
      "url": "https://venturebeat.com"
    },
    "sentiment_score": 0.4003
  },
  {
    "title": "Microsoft Just Hit The Brakes On Windows Copilot+ PCs' Creepiest Feature",
    "description": "Walking back the controversial 'Recall' feature, Microsoft is changing a new default Windows Copilot setting that was the source of new privacy concerns.",
    "content": "Microsoft Just Hit The Brakes On Windows Copilot+ PCs' Creepiest Feature Microsoft recently introduced a fancy new feature called Recall for Copilot+ AI PCs offered under its Surface lineup, as well as OEM partners that are once again putting their f... [974 chars]",
    "url": "https://www.slashgear.com/1598407/microsoft-hits-brakes-on-windows-copilot-recall/",
    "image": "https://www.slashgear.com/img/gallery/microsoft-just-hit-the-brakes-on-windows-copilot-pcs-creepiest-feature/l-intro-1717790358.jpg",
    "publishedAt": "2024-06-07T19:59:31Z",
    "source": {
      "name": "SlashGear",
      "url": "https://www.slashgear.com"
    },
    "sentiment_score": 0.2732
  },
  {
    "title": "Microsoft won’t apologize for AI Recall feature’s security holes, but it is making changes",
    "description": "Microsoft has promised changes to its Recall feature that will seek to make the AI tool more secure. It stopped short of an apology, though.",
    "content": "It’s only a few days until Apple unveils its own AI features at WWDC with an emphasize on privacy. The time is right for one of the company’s chief competitors, Microsoft, to address the ‘security disaster’ that its hallmark AI feature, Recall, is sa... [1754 chars]",
    "url": "https://9to5mac.com/2024/06/07/microsoft-wont-apologize-for-ai-recall-features-security-holes/",
    "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/06/microsoft-recall-ai.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "publishedAt": "2024-06-07T17:11:39Z",
    "source": {
      "name": "9to5Mac",
      "url": "https://9to5mac.com"
    },
    "sentiment_score": 0.0
  },
  {
    "title": "Microsoft moves to resolve privacy concerns over its Recall feature",
    "description": "Microsoft is making changes to its Recall feature on Copilot+ PCs in an attempt to resolve privacy concerns. The tool will be opt-in, so it won’t screenshot your activity without permission.",
    "content": "Microsoft has attempted to soothe privacy concerns regarding Recall , an upcoming Windows feature that’s said to help users resurface just about anything they’ve previously done or looked at on a Copilot+ PC. That naturally involves keeping tabs on h... [1821 chars]",
    "url": "https://www.engadget.com/microsoft-moves-to-resolve-privacy-concerns-over-its-recall-feature-170318905.html",
    "image": "https://s.yimg.com/ny/api/res/1.2/vkxF65FGo.facTtqLB_rOA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-06/5a0247d0-24ee-11ef-9db7-f808e144520b",
    "publishedAt": "2024-06-07T17:03:18Z",
    "source": {
      "name": "Engadget",
      "url": "https://www.engadget.com"
    },
    "sentiment_score": 0.6369
  },
  {
    "title": "Microsoft makes Recall feature off-by-default after security and privacy backlash",
    "description": "Windows Hello authentication, additional encryption being added to protect data.",
    "content": "Microsoft's upcoming Recall feature in Windows 11 has generated a wave of controversy this week following early testing that revealed huge security holes. The initial version of Recall saves screenshots and a large plaintext database tracking everyth... [4423 chars]",
    "url": "https://arstechnica.com/gadgets/2024/06/microsoft-makes-recall-feature-off-by-default-after-security-and-privacy-backlash/",
    "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/06/OOBEAsset_1920-1024x649-1-760x380.jpeg",
    "publishedAt": "2024-06-07T16:59:43Z",
    "source": {
      "name": "Ars Technica",
      "url": "https://arstechnica.com"
    },
    "sentiment_score": 0.5719
  },
  {
    "title": "Microsoft Showcases Auto SR \"Automatic Super Resolution\", The First OS-Integrated AI Upscaling Technology Powered By NPUs",
    "description": "Microsoft unveiled its Auto SR upscaling technology, Automatic Super Resolution, which utilizes the power of NPUs to enhance image quality.",
    "content": "Microsoft has unveiled its Auto SR upscaling technology, Automatic Super Resolution, which utilizes the power of modern-day NPUs to enhance image quality. Microsoft's Automatic Super Resolution \"Auto SR\" Upscaling Technology Focuses Upon Utilizing Ca... [4130 chars]",
    "url": "https://wccftech.com/microsoft-showcases-auto-sr-automatic-super-resolution-the-first-os-integrated-ai-upscaling-technology-powered-by-npus/",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2024/05/Microsoft-Automatic-Super-Resolution-Copilot-PCs.png",
    "publishedAt": "2024-06-07T13:31:22Z",
    "source": {
      "name": "Wccftech",
      "url": "https://wccftech.com"
    },
    "sentiment_score": 0.8316
  },
  {
    "title": "Xbox Is Releasing Three New Models This Year",
    "description": "Microsoft just announced an all-digital Xbox Series X for holiday 2024, plus a white 1TB Xbox Series S and a special edition Series X with a new paint job and extra storage space.",
    "content": "We may earn a commission from links on this page. Credit: Xbox Summer is the season for new game announcements, but alongside a new Doom and the next Call of Duty, Sunday’s Xbox Games Showcase actually debuted some new Xbox consoles as well. This isn... [1636 chars]",
    "url": "https://lifehacker.com/entertainment/xbox-is-releasing-three-new-models-this-year",
    "image": "https://lifehacker.com/imagery/articles/01J019K7ZCHGN3TT38GES55ABB/hero-image.fill.size_1200x675.jpg",
    "publishedAt": "2024-06-10T15:30:00Z",
    "source": {
      "name": "Lifehacker",
      "url": "https://lifehacker.com"
    },
    "sentiment_score": -0.0258
  },
  {
    "title": "Happy Father’s Day! Lifetime Office 2021 Pro Licenses for Just $27.25",
    "description": "Father's Day Deals on Microsoft Office and Windows Licenses - Time to Upgrade Your Dad's PC for Just $27.25",
    "content": "Stuck on a Father's Day gift your dad will actually use day in and day out? If your dad recently got a new laptop or hasn't upgraded his productivity tools in a while, this Microsoft bundle may be the ideal gift idea. MS Software licenses are discoun... [3841 chars]",
    "url": "https://wccftech.com/happy-fathers-day-lifetime-office-2021-pro-licenses-for-just-27-25/",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2024/06/godeal.jpg",
    "publishedAt": "2024-06-10T12:00:29Z",
    "source": {
      "name": "Wccftech",
      "url": "https://wccftech.com"
    },
    "sentiment_score": 0.802
  },
  {
    "title": "Microsoft's New Xbox Console Options Include Galaxy Black Special Edition",
    "description": "Microsoft has unveiled three new variations of its latest-generation Xbox console series, including a limited production version with a special design.",
    "content": "Microsoft's New Xbox Console Options Include Galaxy Black Special Edition Microsoft is bringing a trio of new console configurations to shelves this holiday season. The most notable addition to the portfolio is the Xbox Series X Digital Edition, whic... [1144 chars]",
    "url": "https://www.slashgear.com/1598987/microsoft-new-xbox-console-options-galaxy-black-special-edition/",
    "image": "https://www.slashgear.com/img/gallery/microsofts-new-xbox-console-options-include-galaxy-black-special-edition/l-intro-1717964288.jpg",
    "publishedAt": "2024-06-09T20:36:46Z",
    "source": {
      "name": "SlashGear",
      "url": "https://www.slashgear.com"
    },
    "sentiment_score": 0.7027
  },
  {
    "title": "Apple market cap passes Microsoft after AI launch at WWDC",
    "description": "Apple's market capitalization reached $3.3 billion following its launch of Apple Intelligence",
    "content": "Apple decided it had enough time standing in the shadows. After five long months of trailing behind Microsoft — and even Nvidia, as of last week — Apple has once again reclaimed its spot as the world’s most valuable company. Since launching its AI in... [1895 chars]",
    "url": "https://qz.com/apple-market-capitalization-passes-microsoft-worlds-mos-1851535146",
    "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/61478af59c2fc065297027c754d468fa.jpg",
    "publishedAt": "2024-06-12T15:00:00Z",
    "source": {
      "name": "Quartz India",
      "url": "https://qz.com"
    },
    "sentiment_score": 0.5256
  },
  {
    "title": "Game over for Twitter/X as Nintendo follows Microsoft and Sony in removing integration",
    "description": "Nintendo decided to end X support for the Switch on June 10 as part of the handheld's 18.1.0 update, meaning no more account linking or directly posting...",
    "content": "What just happened? There was a time when a console came with Twitter (RIP) integration as a standard feature, allowing users to connect their accounts and share gameplay clips directly, among other things. Now, however, none of the three current-gen... [1839 chars]",
    "url": "https://www.techspot.com/news/103358-game-over-twitterx-nintendo-follows-microsoft-sony-removing.html",
    "image": "https://www.techspot.com/images2/news/bigimage/2021/11/2021-11-22-image-7.jpg",
    "publishedAt": "2024-06-12T10:17:00Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    },
    "sentiment_score": 0.296
  },
  {
    "title": "Microsoft kills off Copilot GPT Builder after just 3 months",
    "description": "The move is not likely to be viewed favorably by users who spent time, energy, and money on a subscription to create custom Copilot GPTs.",
    "content": "It's time to celebrate the incredible women leading the way in AI! Nominate your inspiring leaders for VentureBeat’s Women in AI Awards today before June 18. Learn More Oh Copilot GPT Builder, we hardly knew ye… As first reported by Microsoft-focused... [5520 chars]",
    "url": "https://venturebeat.com/ai/microsoft-kills-off-copilot-gpt-builder-after-just-3-months/",
    "image": "https://venturebeat.com/wp-content/themes/vb-news/img/favicon.ico",
    "publishedAt": "2024-06-11T20:41:55Z",
    "source": {
      "name": "VentureBeat",
      "url": "https://venturebeat.com"
    },
    "sentiment_score": 0.8687
  },
  {
    "title": "Microsoft seems to be walking into a security nightmare with Copilot+ Recall",
    "description": "After a security expert discovered that Recall saves plain text logs of user activity in MySQL, Microsoft may be putting itself in big trouble.",
    "content": "Key Takeaways Having plain-text logs leaves Recall open to remote hackers due to its MySQL database storage. If someone gains access to the database, they can cause serious damage and retrieve personal information. Recall indiscriminately saves every... [5026 chars]",
    "url": "https://www.xda-developers.com/microsoft-security-nightmare-copilot-recall/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/wm/2024/05/satya-nadella-copilot-1.jpg",
    "publishedAt": "2024-06-11T19:00:16Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": -0.2732
  },
  {
    "title": "The Most Important Differences Between Microsoft Copilot and Copilot Pro",
    "description": "Copilot, Microsoft's chatbot, is a free-to-use experience. But the company does offer Copilot Pro, a $20 per-month subscription that adds some extra perks to the platform.",
    "content": "Credit: Image: Microsoft; gguy/Shutterstock.com Microsoft has largely billed its AI chatbot, Copilot, as a free-to-use AI experience. You can download the app, call up the chatbot in Windows 11, or use Copilot's website to do all the things you expec... [5182 chars]",
    "url": "https://lifehacker.com/tech/the-biggest-differences-between-copilot-and-copilot-pro",
    "image": "https://lifehacker.com/imagery/articles/01HZHZP32BK7JQKKA1HS237F91/hero-image.fill.size_1200x675.jpg",
    "publishedAt": "2024-06-11T13:30:00Z",
    "source": {
      "name": "Lifehacker",
      "url": "https://lifehacker.com"
    },
    "sentiment_score": 0.3818
  },
  {
    "title": "Apple stock soars 7% to record highs after AI-focused WWDC event",
    "description": "The iPhone maker is now just $29 billion in market value away from eclipsing Microsoft as the world's largest company.",
    "content": "Apple stock soared 7% to a record high as investors cheered developments unveiled at its WWDC event. Apple gained as much as $198 billion in market value on Tuesday. The iPhone maker is now just $29 billion in market value away from eclipsing Microso... [2300 chars]",
    "url": "https://markets.businessinsider.com/news/stocks/apple-stock-price-soars-new-record-high-ai-focused-wwdc-2024-6",
    "image": "https://i.insider.com/66688501764df16112588fe3?width=1200&format=jpeg",
    "publishedAt": "2024-06-11T04:00:00Z",
    "source": {
      "name": "Business Insider",
      "url": "https://markets.businessinsider.com"
    },
    "sentiment_score": 0.8658
  },
  {
    "title": "Microsoft Is Pulling Recall From Copilot+ at Launch",
    "description": "Microsoft's controversial new Recall feature won't be on Copilot+ laptops at launch, instead being moved to Windows Insiders in the coming weeks.",
    "content": "Credit: JASON REDMOND / Contributor/AFP via Getty Images It’s been a tough few weeks for Microsoft’s headlining Copilot+ feature, and it hasn't even launched yet. After being called out for security concerns before being made opt-in by default , Reca... [2298 chars]",
    "url": "https://lifehacker.com/tech/microsoft-pulling-recall-from-copilot-at-launch",
    "image": "https://lifehacker.com/imagery/articles/01J0BVKSX0V91EC8VG3G04ZSNV/hero-image.fill.size_1200x675.png",
    "publishedAt": "2024-06-14T18:30:00Z",
    "source": {
      "name": "Lifehacker",
      "url": "https://lifehacker.com"
    },
    "sentiment_score": 0.4819
  },
  {
    "title": "Microsoft ships new laptops without including controversial new AI feature - for now",
    "description": "New laptops equipped with Microsoft Windows start shipping to customers next week without a flagship feature called Recall that drew concerns about privacy and cybersecurity.",
    "content": "New laptops equipped with Microsoft Windows start shipping to customers next week without a flagship feature called Recall that drew concerns about privacy and cybersecurity. Microsoft CEO Satya Nadella touted the new Recall feature at a showcase eve... [1848 chars]",
    "url": "https://nypost.com/2024/06/14/business/microsoft-ships-new-laptops-without-including-controversial-new-ai-feature-for-now/",
    "image": "https://nypost.com/wp-content/uploads/sites/2/2024/06/newspress-collage-f23xef7mv-1718388294868.jpg?quality=75&strip=all&1718373929&w=1024",
    "publishedAt": "2024-06-14T18:03:43Z",
    "source": {
      "name": "New York Post",
      "url": "https://nypost.com"
    },
    "sentiment_score": -0.127
  },
  {
    "title": "Microsoft’s privacy-panned Recall AI feature is indefinitely delayed",
    "description": "In an unsurprising conclusion to a tumultuous few weeks for Microsoft’s AI Recall feature, the privacy-panned feature is being delayed.",
    "content": "Microsoft has had quite the few weeks of ups and downs. Following a strong launch event for its AI-centric Copilot Plus PC devices, the hallmark AI feature was deemed by an expert as a ‘security disaster.’ It took a while, but the company responded—n... [1644 chars]",
    "url": "https://9to5mac.com/2024/06/14/its-official-microsofts-privacy-panned-recall-ai-feature-is-indefinitely-delayed/",
    "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/05/Microsofts-MacBook-Air.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "publishedAt": "2024-06-14T17:50:13Z",
    "source": {
      "name": "9to5Mac",
      "url": "https://9to5mac.com"
    },
    "sentiment_score": 0.2846
  },
  {
    "title": "Microsoft Edge 126 brings AI theme generator for some users",
    "description": "Microsoft has rolled out Edge version 126 which contains a couple of AI-focused features, now available to some users.",
    "content": "Key Takeaways Edge 126 introduces AI theme generator feature for users to create custom browser themes. Controlled rollout of Copilot summarization notification in Edge 126 has also begun. Edge 126 includes new policies like ProactiveAuthWorkflowEnab... [2207 chars]",
    "url": "https://www.xda-developers.com/microsoft-edge-126-ai-theme-generator/",
    "image": "https://static1.xdaimages.com/wordpress/wp-content/uploads/2023/09/microsoft-edge.jpg",
    "publishedAt": "2024-06-14T14:40:09Z",
    "source": {
      "name": "XDA Developers",
      "url": "https://www.xda-developers.com"
    },
    "sentiment_score": 0.5574
  },
  {
    "title": "Microsoft Delays Controversial Recall AI Feature As Privacy Concerns Mount",
    "description": "The original plan was to make Recall broadly available on Copilot+ PCs on June 18, 2024 (next Tuesday), but now Microsoft is rethinking things.",
    "content": "When the first batch of Copilot+ PCs release to retail next week (they're already up for preorder ), they'll be missing a key AI feature that Microsoft remains bullish on—Recall, which aims to make it easier for users to retrace their steps by taking... [2475 chars]",
    "url": "https://hothardware.com/news/microsoft-delays-recall-ai-feature-privacy-concerns",
    "image": "https://images.hothardware.com/contentimages/newsitem/64791/content/hero-microsoft-recall.jpg",
    "publishedAt": "2024-06-14T13:51:00Z",
    "source": {
      "name": "Hot Hardware",
      "url": "https://hothardware.com"
    },
    "sentiment_score": 0.1531
  },
  {
    "title": "Kingston Police share details on Microsoft login scam",
    "description": "(Kingston, Ontario) Kingston Police have shared details on another scam using malicious links in emails --- this time they look like they're from Microsoft.",
    "content": "Photo by Sergey Zolkin. Kingston Police have shared details on another scam using malicious links in emails — this time they look like they’re from Microsoft. According to a release from Kingston Police, scammers frequently try to trick you into clic... [979 chars]",
    "url": "https://www.kingstonist.com/news/kingston-police-share-details-on-microsoft-login-scam/",
    "image": "http://www.kingstonist.com/wp-content/uploads/2019/07/sergey-zolkin-_UeY8aTI6d0-computer-scaled.jpg",
    "publishedAt": "2024-06-14T13:19:23Z",
    "source": {
      "name": "Kingstonist",
      "url": "https://www.kingstonist.com"
    },
    "sentiment_score": -0.0
  },
  {
    "title": "Microsoft delays the launch of Recall feature following intense criticism",
    "description": "There has been a global outcry over Recall since it was announced by Microsoft on May 20. Initially set for an official launch in the Copilot+ PCs,...",
    "content": "Facepalm: After weeks of anger and outcry, Microsoft has decided to postpone the upcoming release of its controversial Recall feature. The auto-screenshotting tool was supposed to arrive on June 18 alongside the launch of the Copilot+ PCs. Now, its a... [2197 chars]",
    "url": "https://www.techspot.com/news/103395-microsoft-delays-launch-recall-feature-following-intense-criticism.html",
    "image": "https://www.techspot.com/images2/news/bigimage/2024/06/2024-06-04-image-27.jpg",
    "publishedAt": "2024-06-14T11:54:00Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    },
    "sentiment_score": -0.8658
  },
  {
    "title": "Microsoft Recall gets a total recall - so what’s the point of Copilot+ PCs again?",
    "description": "Microsoft announced that its controversial Recall AI feature will be delayed to 'ensure the experience meets our high standards for quality and security.'",
    "content": "Copilot+ PCs look set to be the first real challenger to the prowess of Apple MacBooks, but one of their key new features is getting a delay due to security experts warning it could be a “disaster.” In a blog update , Microsoft announced that its con... [4786 chars]",
    "url": "https://www.tomsguide.com/computing/laptops/microsoft-recall-gets-a-total-recall-so-whats-the-point-of-copilot-pcs-again",
    "image": "https://cdn.mos.cms.futurecdn.net/jJLBn9JXcfXreTCgBisctQ-1200-80.jpg",
    "publishedAt": "2024-06-14T11:53:48Z",
    "source": {
      "name": "Tom's Guide",
      "url": "https://www.tomsguide.com"
    },
    "sentiment_score": -0.4019
  },
  {
    "title": "Microsoft in damage-control mode, says it will prioritize security over AI",
    "description": "Microsoft CEO Satya Nadella is now personally responsible for security flaws.",
    "content": "Microsoft is pivoting its company culture to make security a top priority, President Brad Smith testified to Congress on Thursday, promising that security will be \"more important even than the company’s work on artificial intelligence.\" Satya Nadella... [5519 chars]",
    "url": "https://arstechnica.com/tech-policy/2024/06/microsoft-in-damage-control-mode-says-it-will-prioritize-security-over-ai/",
    "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/06/GettyImages-2156786701-760x380.jpg",
    "publishedAt": "2024-06-13T20:38:58Z",
    "source": {
      "name": "Ars Technica",
      "url": "https://arstechnica.com"
    },
    "sentiment_score": 0.9099
  },
  {
    "title": "How to use Microsoft Designer's Image Creator (formerly Bing Image Creator)",
    "description": "It's free, there's no waitlist, and you don't need to use Edge to access it. Here's everything you need to know to use Microsoft's AI art generator.",
    "content": "An AI-generated photo created with Microsoft Designer using the prompt \"a photo of a cool robot taking a picture with a DSLR camera in a photography studio.\" Maria Diaz/ZDNET via Image Creator from Designer As the use of different artificial intellig... [7900 chars]",
    "url": "https://www.zdnet.com/article/how-to-use-bing-image-creator-microsoft-designer/",
    "image": "https://www.zdnet.com/a/img/resize/9555f75b79786697d5f689e9d2f53c00539681df/2024/06/12/51ab5fd7-59c9-4d2b-b138-1e5a0ae01283/designer.jpg?auto=webp&fit=crop&height=675&width=1200",
    "publishedAt": "2024-06-13T06:26:00Z",
    "source": {
      "name": "ZDNet",
      "url": "https://www.zdnet.com"
    },
    "sentiment_score": 0.5106
  }
]